{
  "nodes":[
    {"id": "good", "group" :1,"content":"- And as Neighborhood Markets go, this one was pretty good. The shelves were stocked, the store was tidy on a Sunday morning and the associates who I encountered knew the Ten Foot Rule.<br>- It was a good shop.<br>- We probably eat more at Wolfgangs than any other place inside MGM. Always really good chow and service. Thanks folks. Well done.<br>- Great service, fresh tasty food, good drinks, romantic ambiance, live music in the back courtyard - we loved it all. Highly recommended over many other spots to eat at in the area, and I feel it's even better to come here without children at night if looking for a more romantic and adult kind of dining experience.<br>- Service was good and attentive. I'm not a Southern food person but this is 1 good solid restaurant worth to check out. <br>- We had just arrived in Charlotte and it was late at night. We were looking for a place with 1) TVs to watch the unfortunate game on Sunday night and 2) good food.<br>- Overall, everything was good. The Prosciutto Crostini was the weakest link. We really loved the fries. We were beyond stuffed (5 of us total) and had some leftovers. If you go, I would recommend that you order at most 2 items per person to start.<br>- They make good raspberry iced tea!<br>- Holy crap! Screw it if it's a long drive from Dilworth to Cornelius, this is officially my new favorite thrift store to go to! I was driving around Cornelius and saw this in an unassuming strip mall and felt compelled to go in for I am a girl on a budget. This Salvation is absolutely huge and I now know where all the Lake Norman-ites are donating their stuff! I like to jam when I shop and they had a mix of hip hop and gospel music to raise my spirits for all the good deals I found. <br>- I found so many good buys--beautiful wool Ralph Lauren pants for $3.99, jeans for $2, a summer time top half off which brought it down to $2, two pairs of shoes for $12 and a Vera Bradley scarf for $.50---walked outta there spending under $22--love it! Most of the clothes I was sorting through were swanky  label names I've seen time and time again and they had a pretty sweet shoe selection including Kenneth Cole, Nine West and other quality names. Their furniture selection is sick as well---the entire front of the store is loaded up with furniture and I wanted to plop down on one of the love seats and kick up my heels on the matching ottoman! They have a different tag of the day sale which leaves anything with that color tag 50% off and every Wednesday ALL clothes are 50%. Gotta love brand nice prices for super cheap. Plus my money is going to a good cause, I love shopping for charity! Peace out Good Will, Salvation Army has my heart (and my money) now!<br>- Convenient spot from Alexis Park Resort to walk over and get a decent breakfast. I had an eggs and sausage with home fries and wheat toast and my friend had the egg and spinach scramble. The food was good (especially the potatoes--they were like tater tots!) and service was nice but the menu was kind of limited. I enjoyed watching all the old 80s music videos on the wall monitors and was pleasantly surprised to discover their 20% off Yelp check in deal (food and non-alcoholic beverages only)!<br>- Now, I have to admit that the food is quite good here, and worthy of the many glowing reviews being bandied about.<br>- We started with a Family Style Canoe which featured crunchy golden style lobster potstickers, sesame seared shrimp, grilled Szechuan pork ribs, and blackened island ahi. Everything on this appetizer boat was very good, but the ribs were absolutely amazing! I pretty much scoffed down all four ribs that were on the plate - sorry everyone who didn't get one!<br>- It was a good way to kill 3 or 4 hours, and we headed back to our hotel in time to freshen up and get ready for the hockey game.<br>- Figuring I would start right at the top of the menu, I chose the Number One which comes with hot relish, onions, mustard and a pickle spear. It was a good choice. Nice amount of toppings and the bun was perfectly toasted. Don't get me wrong, I'm usually a boiled wiener rather than a roasted weiner kind of guy, but there's just something to be said about that charred flavor! (Next time, I'll read Ben's review and try peanut butter, sriracha, and bacon.)<br>- PSS.  Don't forget to take the Lobster Mashed Potatoes...it's soooo good!<br>- Free is good... Free is sweet... <br>- I thought that I'd never find anyone that comes close to M&M's infamous blueberry donuts.  But guess what?  Donut Hut located off Desert Inn on the east side of town has blueberry donuts that are as good as it gets.  Even better...you don't have to travel all the way to Anaheim and wait 45 minutes in line to get one.  Here at the Donut Hut, their blueberry donuts are ready, fresh, and are for real.  Their blueberry donuts are crunchy on the outside and moist on the inside, which is the perfect texture for a blueberry donut.  Don't expect a plain donut with candy coated blueberry flavor here.  You get the real thing with real blueberries.  Trust me, one of the best blueberry donuts that I've ever had. I also tried their French Cruller, which is only served on Thursday, Friday, and Saturday's.  Still pretty good, but I'm still thinking about them blueberry donuts. <br>- A delicious update! I haven't been here since they expanded their space and changed up the menu a bit so we decided to try out Crepe Bar for breakfast today. We got here a few minutes after opening (9 AM on Sunday) and there was already a line 5-6 people deep to order! That gave us time to decide what to get at least. There is a good variety of savory and sweet crepes, various coffee and tea beverages, and a small selection of non crepe items. I had the octopus crepe, tried a bit of the tahini chicken crepe, and shared the dulce de leche crepe to finish our meal. <br>- While we were waiting for our order the server brought out a small plate of chicharron with dipping sauce. It was a great way to pique our appetite and had a lovely presentation. Our entrees looked even more beautiful, with a well balanced presentation and mix of colors. My octopus crepe was served on 3 small crepes open faced. Because the crepes were thin, and the filling plentiful but crumbly it was hard to get a good bite of filling with crepe. I loved the presentation but I think having a more traditional folded up crepe would make it easier to eat the dish. In general the octopus was tender and flavorful but was slightly chewier than the amazing octopus dish at Virtu and Nico's Heirloom Kitchen. The chorizo in the dish was decent, but after a while I was wishing there were a slightly sweet element in the dish to balance out all the salty flavors. Perhaps a small squeeze of orange would help brighten up the dish.<br>- Overall, the location of the Venetian is good; you could also go to Tao Beach or Tao Nightclub conveniently.  I would say it's a good spot if you're coming with a group and looking to share a room.  Look for discounts!  We had missed a deal months earlier but it still ended up being $1000 total for both nights which is decent if you're splitting that between 10 girls.<br>- In all honesty, you're paying for the view, because even though my eggs benedicts were good, $65 for brunch for 2 people was a little steep.<br>"},
    {"id": "decent", "group" :2,"content":"- Convenient spot from Alexis Park Resort to walk over and get a decent breakfast. I had an eggs and sausage with home fries and wheat toast and my friend had the egg and spinach scramble. The food was good (especially the potatoes--they were like tater tots!) and service was nice but the menu was kind of limited. I enjoyed watching all the old 80s music videos on the wall monitors and was pleasantly surprised to discover their 20% off Yelp check in deal (food and non-alcoholic beverages only)!<br>- While we were waiting for our order the server brought out a small plate of chicharron with dipping sauce. It was a great way to pique our appetite and had a lovely presentation. Our entrees looked even more beautiful, with a well balanced presentation and mix of colors. My octopus crepe was served on 3 small crepes open faced. Because the crepes were thin, and the filling plentiful but crumbly it was hard to get a good bite of filling with crepe. I loved the presentation but I think having a more traditional folded up crepe would make it easier to eat the dish. In general the octopus was tender and flavorful but was slightly chewier than the amazing octopus dish at Virtu and Nico's Heirloom Kitchen. The chorizo in the dish was decent, but after a while I was wishing there were a slightly sweet element in the dish to balance out all the salty flavors. Perhaps a small squeeze of orange would help brighten up the dish.<br>- Overall, the location of the Venetian is good; you could also go to Tao Beach or Tao Nightclub conveniently.  I would say it's a good spot if you're coming with a group and looking to share a room.  Look for discounts!  We had missed a deal months earlier but it still ended up being $1000 total for both nights which is decent if you're splitting that between 10 girls.<br>- But they did have PRIME RIB for brunch! OH MAN it was sooooo damn good. I ate tons of prime rib and bacon for brunch. The Chinese food looked iffy so stay away from that. But the breakfast items are good, and the spicy tuna handrolls are also decent. They're also pretty damn spicy. <br>- By far the most impressive part of the buffet was the multitude of fish courses (both cold and hot) and the sushi bar that included hand rolls.  The sushi for lunch was generally standard, but the hand rolls and spring rolls were really delicious. There were at least five different types of cooked fish courses, all executed remarkably well for a buffet. Other favorites were the sweet potato puree (pure heaven) and the creamy polenta. The sliders were surprisingly excellent, although the lamb and flank steak I tried were nothing special.  The cooked vegetables at this buffet are executed really well.  Not mushy or dried out.  The green beans and grilled asparagus were particularly good. Even the pizza here was decent and everyone knows how bad pizza can get at a buffet! <br>- With the seated area outdoors, I was enticed to eat outdoors that day.  I was about to leave back to Chicago on this day, but thought it would be nice to get some healthy food and check out a new spot.  The interior is pretty open and functions without the need for a waitress, but not like a fast food joint.  They have quite an extensive menu for a healthy food spot.  I thought it might even be just vegetarian, but it's not.  My coffee wasn't very good because I had her add in the fat free caramel syrup, so that was my own fault.  So many things sounded good here, and I ended up choosing the steak and egg scramble.  It was a pretty nice portion and tasty.  I could totally see myself coming here after a good workout or something and feel good about myself after choosing anything to eat here.  The prices are decent, and the service was alright.<br>- There are a lot of toppings and varieties to choose from, and the combos (which come with a soda) are a decent value. The meat toppings are fairly good quality and pretty tasty, unlike generic poutine, so you feel as if you're eating something that's somewhat upscale instead of the plebeian comfort food that it's made out to be. <br>- We came in on Memorial Day and took advantage of the happy hour taco menu - the skirt steak and braised pork with pineapple tacos were super tasty and a decent size.  We started with the street corn queso and ate it all up...it was really good!  The patio is great and pretty large, the service was friendly and the food was good.  We had a few issues with our order, but they rebounded and made it right.<br>- Overall, I'd say that this is a good place to go for a decent buffet without breaking the bank.<br>- Of the other items I tried, there were two kinds of MUSSELS -- one hot and cold.  Both were decent.  There were four different soups...you have to really look for them.  I tried the MISO, which I liked.  As usual I stayed away from the sushi, but decided to try the SALMON and AHI POKE because it looked surprisingly good and it was.<br>- For our dinner we decided to order a XL cheese pizza and also a large white pizza.  We started with the white pizza and boy did it hit the spot.  The crust was crunchy, the garlic and herbs in the oil sauce were tasty and the cheese was decent as well.  Our red pizza was a similar experience as I imagine the cheese and crust were the same and while the red sauce was good, it lacked a little of the oomph that white sauce had.  Overall though they were two very solid pizzas that I enjoyed.<br>- It's located at the very end of Concourse C. It's a decent size Starbucks, with a good bit of seating. There seemed to be adequate staff - there were four people working, one was cleaning and space seemed to be very tight behind the counter. But the staff were friendly and conducted themselves in an outgoing fashion and with a sense of humor.<br>- I had not been here in about a year and most of the staff from then was long gone. The new manager (young shaved head) was very nice on this night, putting on the volume for the Jeter finale. The Hooters female bartender was prompt, but overall the staff wasn't as attractive as I recall in previous visits. They also removed the Beer of the Month special and it was 60 cent boneless wings night, but they make you get ten. They should let you get five and of course no dressing is included. They copied BWW exactly, no creativity. Well, the TV's are still great and the beer is still served icy and the mozzarella sticks at HH price were decent, so still a good place to catch a game.<br>- Service was decent and drinks were refilled as needed.  Definitely a good spot to eat at if you're in the downtown area.<br>- We stopped in for happy hour one evening in August and had a good experience!  We enjoyed 1/2 price tacos and wine at the bar.  Friendly bartender, decent tacos and nice atmosphere.  I hear they are going to renovate the space and I think it definitely needs a facelift.  Excited to come back this winter and checkout the rooftop bar!<br>- You might think it odd, right? South Park seems like they would have a decent selection - but for whatever reason, theirs isn't very good. Monroe? Not good. Concord? Pineville? Not that great either.<br>- After being on my bucket list for awhile, I finally made it out to El Chorro for happy hour yesterday. This place has a legit happy hour! Everything on the HH menu is 3$.... that is crazy! We had decent margaritas that were on the strong side (3$), split the sliders (3 sliders and fries for 3$... and the meat was good, juicy and seasoned with onions... really yummy stuff), and the sticky buns (pretty standard sticky buns). The food was tasty and inexpensive... the portions were large. I wouldn't hesitate to recommend this place for HH and I know I'll be back!<br>- Lowlights were the rolls.  A few of them were just plain not good; the others decent but not memorable. <br>"},
    {"id": "tasty", "group" :2,"content":"- Olive & Ivy is so gorgeous! It's huge and super crowded. We walked in to try to have brunch and were told that there would be a 45 minute wait for a table. A few bar seats opened up so we stationed ourselves there instead. The Moscow Mules were to my liking (Mediterranean Mules) and I ordered a tasty Lamb Gyro sandwich. I definitely had food envy when his perfectly cooked salmon arrived. It was delicious.<br>- Place was delicious! Staff is friendly and efficient and the location isn't too bad with it bing less than 2 miles from exiting the I-10. The sesame chicken was my favorite main dish. The carb rangoons don't look like they're tasty but they really are. The pot stickers were good, too. Orange chicken was average and the terayaki salmon was tasty.<br>- Upscale from the usual diner breakfast, this was solidly delicious with great service and great food. After reading the reviews and the tips, I chose the pancakes, which came with bacon and an egg. Bonus points for being able to poach it and as well for the bacon being cooked just the way I like it - not burned and crispy but cooked through. And the pancakes? Excellent. Thick and fluffy and tasty.<br>- I had a business lunch yesterday at Red 8 and really enjoyed it.  We started with the pork potstickers to share and then I followed it up with the chicken with string beans and rice as my entree.  The portion sizes were quite large and the food was quite tasty.  Nicely appointed dining room, professional staff and delicious food = a winning combination for sure!<br>- I can definitely see the appeal of Monty's. This delicious and clean diner serves up some tasty eats with a twist. It didn't take long for my buddy Corey D to share his love and thus I had to experience it for myself.<br>- Oregano's.... you know, everyone in Phoenix has probably been to Oregano's, it's like a Phoenix institution. I got take out from this location and it was tasty, nothing crazy, but just what I'd expect after years of eating at Oregano's. We had the hot wings ('of fire'), and they were a little weird tasting but certainly hot, the stuffed rigatoni (tasty pasta with even tastier garlic bread), and the chicken Caesar salad, which is, by far, my favorite item at Oregano's. The chicken Caesar is so good because the chicken is spicy and delicious...that's it. This is a must order. Will I be at Oregano's again? Of course I will. <br>- The salad was whatever but the sandwich was tasty. The pork was plentiful and tender with a delicious porky flavor although not at all smokey. Fieri's bourbon-brown sugar BBQ sauce was okay but much too runny. This is definitely the messiest sandwich on the Strip. The slaw, onion straws and cheddar cheese rounded out the flavors between the pretzel bun which tried valiantly but ultimately lost the battle to hold everything together.<br>- Single (ENORMOUS) slice with a drink is $5.99. It's a HUGE slice and delicious! They give you a pizza cutter with it because they recognize that it won't be an easy task to eat it with your hands. The employee was extremely fast and helpful. The pizza came out quite quickly and Tasted fresh. Topping were pepperoni and sausage and were tasty, too. Top notch fast food pizza shop compared to its competitors.<br>- A friend and I came here for restaurant week after I had heard so many great things about this restaurant. The place is super cute, the space feels open and modern. The bread they provide (for free) was delicious and came with an awesome spread....yummmm. I started with some pasta in meat sauce that was killer. I think pasta is probably the way to go here. My friend had a salad, which was tasty, but small. For mains, I had the steak....which was ok, not the best teak ever, but good. She had the short ribs, which were awesome! I was jealous. We split a couple desserts that were both alright, nothing super special. I would come back here to eat more pasta!<br>- I loved the savory flavor creations. Very unique and all surprisingly very tasty. The decision of which flavor to actually get a scoop of was difficult. I finally settled on a strawberry one with balsamic vinegar and black pepper, as well as a chocolate one with spicy peppers. Such amazing deliciousness!<br>- It's basically a melty gooey cheesy saucy burger on what seems to be brioche, with tasty thin-patty meat (double), and something that is sort of like McDonald's Big Mac sauce but much better on it. It comes wrapped in foil with an olive on a toothpick stuck in the top. A delicious green olive, no less. These things are dirt cheap (like, under $3) and hearty. Two of them will fill you up, one is perfect for a snack.<br>- Wow.... this place may have a translated name of Squash Blossom, but it is nothing like the old squash blossom... in a good way! They completely redecorated and it now has a Latin club feel. A friend and I wandered in here Saturday night after I saw their open sign through the long hallway and wondered to myself....why is that breakfast place open at 9pm? Anyway, we sat at the bar and it was kind of awesome. We met a couple at the bar that were a lot of fun and we all did many shots...We did some series of shots that included tequila, lime juice, clamato, and beer... very interesting! We also did esperma shots (because of the funny name) which were good, shots of fireball with rum chata (delicious), and we had some of their pina colada based drinks that were sweet and tasty. The bar tender was nice and the prices were affordable (shots = 4$, drinks = 6 ish?). The place is on the loud side and I believe they had a DJ. As it got later, the bar got busier but the service remained very efficient and friendly. I had a great time here and would definitely come back. <br>- I went here today with my supervisor and it was very good! This place was packed...like standing room only. When a table opened shortly before we got our food it was a sweet victory. This place was much better than pei wei for sure. I ordered the pan fried noodles with chicken and it was very tasty.The sauce was all garlicky and delicious and it had a lot of veggies (broccoli, snow peas, carrots, mushrooms, etc), which is a big plus. The noodles were just ok, but what can you expect from a fast place, plus it's awesome that they offer this crispy noodle option to begin with!  My supervisor got the lemon chicken and was excited that they offer brown rice. Overall, it was good and I would go back for sure.<br>- While I've tried many delicious bagel sammies here, but I always go back to my old standby - the Banana Surprise. It's a cinnamon raisin bagel, slathered with cream cheese, covered in bananas and a dusting of cinnamon sugar. It's incredible. Husband always orders a Mr. Turkey with egg, also a delicious choice. All the bagels and bagel sandwiches are steamed and that makes them super tasty and chewy. Oh, and their coffee is local, which just makes me love them even more. <br>- Viva Mexico! Mmmm Cantina - your guacamole never ceases to amaze me. This is a convenient place I frequent whether I need a big, tasty margarita and a few delicious appetizers or when I require a full blown Mexican fiesta.<br>- This place was ridic! The people who work here (owners?) are so nice and accommodating. They started us off with two types of bread, one small round fluffy bread and one larger more dense bread and one of the best hummus type dips I've had.... a little spicy and packed with flavor. They also brought out delicious mint iced tea to sip and even a second hot sweet tea to try... both of which were great. For my entr챕e I got the beef tagine, which was huge! It had the beef and a bunch of veg (potatoes, dates, other delicious stuff) all served boiling hot in a tagine. With this came a huge amount of couscous. The meal was incredibly tasty, the couscous was light, fluffy, and delish... I could only eat a small amount, but was given a to go box and ended up making this one meal into 5 (the husband had some when I got home, and I had it for lunch, dinner, and then another lunch). We were then offered a date shake... so good... sweet, but not too sweet. They also brought out some fried honey cookie things, which I ate despite being ready to burst.<br>- Service was great.  We had a beautiful and friendly waitress from Manitoba**.  She could have been a model!  The food we had was good.  German meatballs were very tasty and generously sized (I'll admit it, I like big balls!) and the calamari was grilled to perfection.  Seriously, it was amazing...so tender and delicious.<br>- I stopped in for lunch on Saturday and had a great experience.  The couple that owns the place is very friendly, the food was fantastic and I LOVE the luncharitas (fresh juice) served in a jar.  The citrus berry was absolutely delicious...I am seriously going to crave this stuff every day!  The chicken dilla was quite tasty - the salsa was legit too!<br>"},
    {"id": "delicious", "group" :1,"content":"- I like it, although it definitely departs from the Southern draw of the other location and that authentic kitchen to table feel. We got the usual deviled eggs, chicken and waffles, and cobbler to finish. Overall the chicken was not as great as the Miami location and the cobbler was a bit disappointing. However, the eggs were delicious and waffles were on point!<br>- A delicious update! I haven't been here since they expanded their space and changed up the menu a bit so we decided to try out Crepe Bar for breakfast today. We got here a few minutes after opening (9 AM on Sunday) and there was already a line 5-6 people deep to order! That gave us time to decide what to get at least. There is a good variety of savory and sweet crepes, various coffee and tea beverages, and a small selection of non crepe items. I had the octopus crepe, tried a bit of the tahini chicken crepe, and shared the dulce de leche crepe to finish our meal. <br>- I finally decided and opted for the 3 different eggs benedict trio (pork belly, crab and regular) and I loved it! The pork belly version was crispy and delicious, like bacon and with the egg yolk dripping on it....perfect! The crab meat benedict didn't have an english muffin on the bottom like the other two, in fact, the CRAB MEAT was the holder! I loved it, generous amounts of crab meat in every bite! I don't know how they managed to keep the eggs from over cooking while still keeping the eggs warm.<br>- It was like a Monet. They looked so delicious from far away, but up close they were just a mess. They didn't taste so good. <br>- I ordered the lunch portion of halibut and it was delicious. Superbly cooked and I could have easily devoured the full portion if I had ordered it. <br>- While I had attempted to eat relatively healthy for lunch, we decided to splurge for dessert and I couldn't say no trying all the options we ordered. We ordered the Turkish coffee cheesecake with pistachio gelato and honey, lemon & raspberry panna cotta and banana strudel. The cheesecake and panna cotta were the stars of the show. They were both so delicious and silky, I had to try my best to resist taking too many samples. <br>- Went here again and shared a lot of dishes.  After trying the lamb kuzi, I was hooked!  Everything was very good, except maybe the musaka, which tasted too sour (Maybe too much tomato in the dish).  They had a very interesting and delicious carrot pudding that night too. Upgrade 1 star!<br>- While scoping out all the cafeteria- line style food vendors and passing on all of their artery-clogging options, I stumbled across Beaudevin.  So glad I did.  But giving up wine for Lent and sitting in this place is like forcing a crack addict to sit in a crack house... Anyway, got the Spinach salad with grilled chicken.  Simply delicious.  Nice layers of egg, bacon, red onion, Pt. Reyes blue cheese, and tossed with olive oil.  Yum.  This place is truly an oasis on the airport food scene.  But wait there's more... They have individual I Pads at the bar that you can freely use.  And there are electrical outlets under the bar to keep your devices going strong.  Bravo.<br>- The Winter (Old) Fashioned was delicious and well-balanced. It wasn't too bitter, but just the right amount of sweet to make a nice finish on the palate. My caprese arrived first: fried green tomatoes, fresh mozz & a fig basalmic. It was hard not to pick it up with my hands and shove it in my mouth. I did the polite thing & took small bites. I would have licked the plate too if I wouldn't have garnered stares from my dining neighbors. The sliders came out quickly after they were ordered & I dove right in. They were cooked perfectly and the 'extras' didn't impede on the experience. The cheese & bacon were in perfect proportion and you got a little bit with each little bite.<br>- By far the most impressive part of the buffet was the multitude of fish courses (both cold and hot) and the sushi bar that included hand rolls.  The sushi for lunch was generally standard, but the hand rolls and spring rolls were really delicious. There were at least five different types of cooked fish courses, all executed remarkably well for a buffet. Other favorites were the sweet potato puree (pure heaven) and the creamy polenta. The sliders were surprisingly excellent, although the lamb and flank steak I tried were nothing special.  The cooked vegetables at this buffet are executed really well.  Not mushy or dried out.  The green beans and grilled asparagus were particularly good. Even the pizza here was decent and everyone knows how bad pizza can get at a buffet! <br>- The only thing that was a bit disappointing here (and only a bit) were the desserts.  I have definitely had better desserts at a buffet before.  For the most part they were really your standard mini desserts with not much flavor.  But even here there were a couple of excellent standouts.  The bread pudding was delicious (and bread pudding can be really dry) and the pumpkin cheesecake was amazing.  <br>- Olive & Ivy is so gorgeous! It's huge and super crowded. We walked in to try to have brunch and were told that there would be a 45 minute wait for a table. A few bar seats opened up so we stationed ourselves there instead. The Moscow Mules were to my liking (Mediterranean Mules) and I ordered a tasty Lamb Gyro sandwich. I definitely had food envy when his perfectly cooked salmon arrived. It was delicious.<br>- I've been to this Boston Market at least three times now, once a coupla years ago on my last trip to Az when my daughter and I were looking for a fast place to grab a bite before a movie at the Tempe Cinema Theater and then I rediscovered it by Yelping the neighborhood for the same purpose a couple of weeks ago.  That time I grabbed a quick Rotisserie Chicken Plate, dark meat (my favorite), with sides of Rotisserie Chicken Noodle Soup (unlimited refills but I didn't have time to partake of that), cornbread, broccoli (gotta get my veggies in when possible), and sweet potatoes casserole.  Other than being a little salty, which concerns me for health reasons, and the casserole being pretty sweet, everything was delicious and I wished I hadn't had to rush thru it but didn't want to eat popcorn on an empty stomach.  It made mighty fine leftovers the next day, too.<br>- Later in the meal a worker walked by and asked how everything was so I politely let her know the everything was delicious accept the meat wasn't hot when served to me.  A man who may have been a manager overheard me and insisted on bringing me a fresh serving of turkey even tho I told him it wasn't necessary.  I ate most of it there because it was even better warm, and added the rest to my leftovers for lunch today.  Needless to say I was highly impressed with this level of customer service.<br>- If you've ever met Rick Moonen, or even just read an interview with him, you know how passionate he is about sustainable seafood. His restaurant, RM Seafood, really highlights these efforts in dishes that are classic, fresh, and delicious.<br>- While Olive and Ivy serve a myriad of snacks, including some very delicious looking baked goods I went for a healthier option - the egg white omelet. It was served with tomatoes, avocados and a side of mixed fruit. On the day I was there the fruit was mostly melon in case you're wondering. Gabi and I also shared an order of wheat toast to round out our meal.<br>-  This shop is very close to my apartment, walkable for me. The coffee is really good. It is from a local roaster in Tempe. Additionally, the people who work there know a lot about coffee. The guy with the darker hair who works there is very interesting and has worked in the coffee business for several years. The owners are hard working and great at making delicious lattes. Everyone is friendly. Additionally, the decor is super cute and the furniture is comfortable. I have never had a bad experience here.<br>- Had to stop myself from eating a mouth full of soap as these things look delicious!<br>- The food was out in good order, and EVERYTHING was exceptional, EVERYTHING! The Chicken Fried Steak was prepared from a nice quality beef, nicely bread and cooked to a perfect outside crust, and then smothered in a delicious white, pepper gravy - perhaps the best version we've had outside the Southwest. The Mashed Potatoes were perhaps not freshly made (more of a puree than a mash) but with more of the white gravy on top, it became a moo point (as Joey would say). The Fried Okra was very well done, as well, also with a nice exterior crust.<br>- I ordered a vegetarian (three-egg) omelette with egg whites, which came with toast & hash browns - and my husband ordered a vegetarian burrito.  We both ordered coffee, too.  The food was *delicious* & portions were quite sufficient, and the coffee was pretty good (a little too weak, but better than at most diners [and also more expensive, at $1.89]).<br>- $36 Turbot: WTF is Turbot? It was the coolest sounding fish entree...I mean, how many restaurants carry Turbot? Luckily it tasted as delicious as its name with the mustard sauce and cavier topping.  <br>- I ended up with a delicious 2 egg breakfast.  I asked for my eggs over medium and for my sides, I chose the creamy grits and sliced tomatoes.  For toast, I asked for a whole wheat tortilla.  I love that option.  I enjoyed it all!<br>- We splurged and ordered the chocolate cake for dessert.  With the chocolate cake came Kona coffee ice cream.  It was sinful.  It was seriously THE most delicious ice cream we have ever tasted.  <br>"},
    {"id": "dishes", "group" :2,"content":"- Went here again and shared a lot of dishes.  After trying the lamb kuzi, I was hooked!  Everything was very good, except maybe the musaka, which tasted too sour (Maybe too much tomato in the dish).  They had a very interesting and delicious carrot pudding that night too. Upgrade 1 star!<br>- If you've ever met Rick Moonen, or even just read an interview with him, you know how passionate he is about sustainable seafood. His restaurant, RM Seafood, really highlights these efforts in dishes that are classic, fresh, and delicious.<br>- As for their food, I got their Loco Moco since it's one of my favorite dishes. Plus, I wanted something with a huge protein count.  In case you're not in the know, a Loco Moco consist of rice, hamburger, eggs, and gravy.  KC mixes their gravy with mushrooms, which was a good touch to be different.  Seems boring, but I have one word for this order...delicious.  This order filled me up, but I wasn't done. I always get a Spam Masubi or Katsu Masubi at least once when I hit up a new Hawaiian joint.  KC didn't have a Katsu Masubi, so a regular spam it is.  I was little disappointed with KC's spam masubi only because it was small, not as tightly wrapped, and the spam was a bit undercooked.  <br>- Everyone else's dishes looked amazing as well. My table mates tried the schwarma and rotisserie chicken and both were dishes I would be interested in trying next time. They smelled absolutely delicious. <br>- My favorite dish is the Fajitas Grandes- tortillas, guacamole, sour cream, pico de gallo, beans, & rice with roast pork, shrimp, beef and chicken. It is soooo good. The roast pork is the best I've ever tasted (I've been to Hawaii many times and I've been to many luaus.) and this is saying a lot since I do not normally eat pork on a regular basis. It is delicious and the portion is generous (I usually ask for a to-go box). You can order this dish for one or two people. My husband's favorite dish here is the seafood burrito with the yummy aforementioned cancun sauce and it does come with beans and rice. I've had this one before; it's very good, but I keep ordering the fajitas. We like other dishes here, don't get me wrong, but these are our favorites.<br>- for our entrees, wifey had the mexicana breakfast off the brunch menu...and i had the grilled skirt steak and eggs...also off the brunch menu.  these items go for 19.99 and include a side of fruit and pastries.  both of our dishes were cooked PERFECTLY...so freakin perfectly that even the eggs were delicious!  and seriously, how often do you hear people say that their eggs are delicious?  the tortilla that came with my dish was definitely homemade...the best tortilla i have ever had!  <br>- Sorry, but I did not get the names of everything we ate.  What I can tell you is that all the Tapas dishes which they chose were delicious from start to finish.   I especially enjoyed the Cured Ham!!  It was melt in my mouth awesomeness!!<br>- All in all, my friend and I had a very enjoyable dining experience with some very delicious pasta dishes. And it's only like 5 minutes from my house. So I will most definitely be returning.<br>- The selection is amazing- broken into region types- Mediterranean, Pacific Rim, South America, North America. Langostino lobster (delicious), snow crab legs (a little salty at times but very good), dungeness crab (mmmm), oysters, peel and eat shrimp (with lemon and cocktail sauce- just like at the resident buffet, very good), crawfish (not a fan), sushi (I'll pass- sushi has to be eaten at a real sushi place), and soups (like chowder), just to name a few. The quality of many of the dishes is very good. <br>- I was quite surprised as the chorizo breakfast burrito I ordered was better than expected, it was delicious. It was warm, had the right amount of spice and blended well with the cheese and beans I added. It was a little greaser than I'm used to for a chorizo burrito but I managed. This restaurant's drive through is open 24/7 and it's on a major intersection in Chandler so it's convenient for me. The menu is diverse and they sell dishes typical fast food Mexican restaurants don't such as chilaquiles and sopes.<br>- Our table started with some appetizers and a salad to share. We got the Crying Tiger, which burned so good, the Malaysian Roti and some spring rolls. They were all delicious. I ordered the Massaman Curry with fried tofu. It was absolutely fantastic with all the unexpected combinations of flavors. Some other dishes we tried were the Red Curry, Pad Se Ew, Black Bean Chicken, Pad Thai with Chicken and another Massaman with Beef instead of tofu. Everything was perfectly flavored and the portions were generous for the price. <br>- Eggcellent menu options with really unique dishes! They have omelettes, French toast, skillets, paninis, sandwiches, wraps, salads, pancakes, waffles, crepes, and so much more. I had an omelette with mascarpone, quinoa, swiss chard and prosciutto. I also tried the side of waffle & and it was deliciously crispy and not dense. It came with a side of fruit, some powdered sugar and maple syrup. I had the fresh strawberry orange juice and thought it was good but a bit sweet. I also tried the pomegranate juice which was also a bit too sweet but had a great tart flavor. My brother said the pancakes were fluffy and delicious. I'd love to come back to try their other dessert breakfast options.  There's plenty of parking and I'm unsure if they take reservations. Your party has to be 100% present for you to be seated. They have an outdoor patio area and a large indoor dining space. They also offer a bunch of coffee options like espresso, lattes, americanos, etc.<br>- Great Irish breakfasts, and other Irish foods like boxty, shepherd's pie, and corned beef and cabbage.  I can't vouch for the more Americanized foods, but the boxty dishes and shepherd's pie I've tried have been delicious, and although I've never been to Ireland to have an Irish breakfast, it tasted pretty good to me!  They certainly used all the ingredients that one would have in Irish breakfast, including blood sausage (Which tastes quite good, despite the sanguinary name).<br>- I asked for a recommendation and was told the Basil Chicken was one of the more popular dishes.  I decided to get it and requested it mild.  My plate arrived expeditiously and was absolutely delicious.  The ingredients were good quality and fresh, it was very well-prepared and perfectly seasoned.  <br>- Sweet potato hash is fantastic!  The tofu scramble has a bit of a spicy kick and is a great option for vegans.  In fact, their veg dishes are just plain good. Service is very friendly and their cheesecake is very creamy and delicious.<br>"},
    {"id": "sauces", "group" :1,"content":"- Part sports bar, part barbecue joint, part tattoo parlor, part concert hall -this place has it all. An ultra cool vibe envelopes you as you walk in. We sampled some of the local beers, had some real nice barbecue, had a super nice server named Sara, man oh man it was all good, I had a Pulled pork plate ($16) with two sides- I went for the cole slaw and the black-eyed peas. I chose a 20 oz Grasshopper draft. Everything was fabulous. The three table sauces, a chipotle concoction, a barbecue sauce, and a zippy mustard were all top notch. We could hear the music thumping downstairs and watched baseball on the upstairs tv screens. What a super cool place - no pretension, no high falutin' anything- just delicious honest food at a fair price. Awesome!!!<br>- We started with a lobster bisque. I was prepared not to like this, as I don't love lobster, but this was sooo good. Creamy, velvety, and not too fishy. It was served with a piece of toast that soaked up the broth...really good. Secondly, we had the same salad as the last time we were there....but it wasn't the same. It had the same components, but it was made correctly this time... last time it was just a piece of brie, with plain undressed arugula, plain nuts and a big piece of poached pear.... this time the salad was dressed perfectly, it had a thin slice of poached pear and a slice of poached apple and the brie was grilled (I think....)... it was so much better. For main dishes we had a filet topped with crab and a bearnaise sauce served with cheesy delicious potatoes, beets which were....beets, and nicely cooked asparagus and sea bass topped with cucumber and avocado served over red quinoa cooked with bacon, roasted carrots, and a delicious sauce (this was super flaky and delicious....the husband liked it better than the steak which is very unusual). Dessert was also tasty, it wasn't what it said it would be on the menu (was supposed to be chocolate espresso, but was a vanilla cake of sorts with several different yummy sauces like caramel and chocolate and served with fresh fruit...the best part? The nuts... really well toasted and added just the right amount of flavor). We weren't offered/didn't get coffee, but that was ok. Additionally, we had our dinner over 1.5 hours... I feel like that is an appropriate amount of time for a coursed dinner, so that was a great improvement. After this experience, I can see us giving this restaurant another chance... we will be back!<br>- I went to Crepe Bar with a friend earlier this weekend and must say that if I lived in the east valley, this place may be my number one breakfast spot. We shared the breakfast burrito crepe and the vanilla bean crepe with strawberries and walnuts. The breakfast burrito crepe was delicious, it was spicy, salty, bacon -y, and all around awesome. The only thing I think is a little funny is that it doesn't really need the crepe (I know, blasphemy!), The eggs on their own would have bean equally as delicious. The sauces were wonderful as well. The sweet crepe was also very tasty, but definitely did not hold up to the other. It was much smaller than the breakfast burrito, but it had a subtly sweet flavor....it didn't hit you in the face with the sweetness, I think because of the buckwheat crepe maybe. Anyway, I would definitely return for breakfast! So why only 4 stars? The coffee.....the coffee was really acidic and I didn't love it so much....I was glad it was free with my Yelp check in (thanks Yelp!).<br>- What a truly pleasant surprise...good food in a car wash/convenience store...who would have thought?  The service was AMAZING...very helpful and right there when you needed it!  Nice, relaxing atmosphere that honestly didn't feel like you were eating in a car wash/convenience store.  The BBQ platter with a 1/4 chicken, macaroni salad and potato salad was quite tasty,  but way too big of a portion for me!  They recommended a few different sauces for me and they were both delicious.  We'll be back!<br>- I ordered the filet mignon medium rare and my buddy Mario ordered a different cut, don't remember which one.  Mine was $40 and his was $42, and both were absolutely delicious.  Neither of us left a bite of steak on our plate.  I'm going back soon and getting Mario's choice because it had so much flavor.  Fleming's also offers complimentary sauces for your steak, of which Mario partook in one.<br>- One person went with the Mangalori Curry which is a spicy sauce/coconut milk combo. He asked for it to be made mild, which was accommodated. It was really tasty but I think would have been much better if prepared at the intended heat level (just FYI). Another person got Tikka Masala which had one of the most flavorful Masala sauces I've encountered. I went with Chana Masala which was a tad spicy and full of delicious flavors. Portions are more than generous, but be aware that you have to order rice separately which adds about $4 to the price of a dish. Of course, we went with some naan which was the perfect combination of fluffy top and crispy bottom.<br>- I was super excited that the people from Crudo were opening a new place and couldn't wait to try it out. The space was a little hard to find as it is in the back of a building that faces 7th (awe parked out front where there were some businesses still being built, but there is a huge lot in back). The restaurant is decorated nicely and has a 'cool' modern feel.  I went with a friend for happy hour and we went a little crazy with ordering. They have so many drinks on special, it was easy to find something that sounded delicious. I tried the okra cup and the cobbler... both were incredibly tasty and strong! I definitely felt them afterwards. We shared some food - the marinara focaccia, wings, Calabrian pork bites, and the biscuit donut. The pork bites came out first and were just ridiculously delish... little pieces of pork belly with a bit of a tang and a hint of spiciness... the portion was small, but the flavor was huge. The huge pile of wings were also wonderful.... they are smoked, which was a bit weird at first, but as we ate them we liked them more and more. The wings came with a 'white' bbq sauce.... I don't know what this was, but it was like crack.... so tasty. In fact, the white sauce and the hot sauce on the table really saved the focaccia, which was nothing special ( but tasted good when you added the sauces). The donut was tasty, but didn't taste much like biscuit... still good though. I will definitely be back, I want to try the Tennessee hot chicken... yum. <br>- For dinner on this evening I decided to go with 6 Walk of Beaver Falls wings on a bed of fries.  Yes you can do that and the fries are tossed with the wing sauce too!  If you look at the menu you will see the Walk of Beaver Falls described as the Talk of Beaver Falls only hotter.  Then if you look at the Talk of Beaver Falls you will see that it is hot and tangy.  A lot of the Wing sauces on the menu are the same way with some that you have to look at 4 different flavors before you find out what it is.  While this annoys me at times it may very well be the only thing that annoys me about Big Shot Bob's.  Their wings are absolutely delicious and this time was no exception.  They are always on the larger side for wings and are juicy and fried perfectly.  Big Shot Bobs wing sauces are also always good and they certainly have enough of them.  My Walk of Beaver Falls ended up reminding me of the Louisiana Lickers sauce from Quaker State only a lot hotter, exactly as described.  It thoroughly coated both the wings and the fries which was awesome since I loved the flavor.  The only downfall to getting the fries coated in the sauce is that they tend to get a little bit soggy.  However I would rather have my Big Shot Bob's fries coated in sauce and a little bit soggy than crispy without any sauce.  By the end of my meal my mouth was on fire and I was pleasantly full.<br>- Always fresh, hot and delicious. Best LOCAL pizza place in both the east and west valley. Their chicken wings are not only delicious because they're cooked well, but because their sauces are awesome. I love the medium buffalo and BBQ flavor. Ask for extra sauce on your wings to avoid them coming out dry.<br>- I also tried Red's for breakfast and had their Southwest Loco Moco, which was Sonoran rice mixed with chorizo and ranchero sauce.  The rice mixture was topped with poached eggs, cotija cheese and sour cream.  The flavors were all delicious.  The poached eggs were nicely done so that the yolk provided a thick and creamy sauce for the dish.  The chorizo was moist and meaty.  The rice was cooked to the right texture and all of the sauces and creams and chorizo combined to provide a spicy and savory breakfast dish.<br>- Since I'm not partial to cooking, my favorite sections are frozen foods and produce. I always stock up on my favorite things here. Their baby carrots, fresh cut fruit and corn are delicious and I stock up on bottled curries and sauces as well. <br>- The chicken here is absolutely delicious! So juicy and fresh, very generous portions. Great service, fair prices and 26 sauces to chose from. The sweet chili is my favorite, but the others weee good too.<br>- Finally tried this place!  Just a note of caution:  We asked for our burger to be cooked medium and it definitely came out medium rare.  So either clarify with the server what the temperatures are or order it slightly more cooked.  The burgers are delicious!  Hearty, too.  The fries are ridiculously good as is the two sauces that come with them.  Looking forward to going back and trying more items on the menu.<br>- For starters, the blue cornmeal pancake filled with BBQ'd duck, topped with habanero chile - star anise sauce.  The presentation is pretty with the different colored sauces and every bite is delicious. <br>- This place is as good as I'd heard.  We came here for a day-late birthday dinner for my middle daughter/Father's Day dinner for her husband.  She and his six-year old daughter ordered a Hawaiian style with pineapple and ham, he and I  got the Margherita Pizza with garlic, tomatoes, olive oil, fresh basil, mozzarella, and romano cheese.  Both were so delicious!  He also got some chicken wings which were tender and juicy and not spicy at all, dipped in either of two great sauces, ranch or marinara.  The pizza's were about $13 each for the larges.  I usually have no problem quitting after two slices but the  flavor squishing around in my mouth was so good I couldn't resist taking a third piece at this place. <br>- Next up we shared a large order of fries with dipping sauces. Piping hot and crisp on the outside, they were a fat kid's dream under the guise of fancypants packaging. We ordered two pizzas, one with egg that could have been ordered at breakfast or late-night, and another with pepperoni and mushroom. I never made it to the latter as I just had to have a second slice of that delicious egg-topped pie. Do yourself a favor and give it a whirl.<br>- For my first visit to this new location, I tried the chicken and sausage combo of the La Surena and it didn't disappoint: a hot packed pocket with creamy avocado slices, spicy sausage, and shredded chicken, which I smothered in their cilantro and spicy sauces. But because I'm a total glutton, I had to add on a beef empanada, which was also damn delicious. <br>- I stopped by here this past Tuesday afternoon for lunch with my father.  I had noticed this place the week before whenever we went by and became eager to try it whenever I noticed its high rating on yelp.  Since I didn't go into the store, the only real thing I can comment on is the taco stand outside.  There was a guy behind the stand cooking everything as well as a condiment bar next to it.  Whenever we walked up he was just finishing up grilling some tortillas.  He greeted us in Spanish before giving us a run down of the taco fillers in English.  I ended getting three, one each of steak, chorizo and chicken.  He quickly made the tacos stuffing them very full.  They consisted of two tortillas with the filling which reminded me of truly authentic tacos.  Whenever I asked about paying he informed that I could pay cash outside or credit inside.  Since I had cash I quickly payed him and moved over to the condiment bar.  They had a number of sauces as well as some onions and a few other veggies.  I ultimately ended up choosing what I think was an avocado based sauce.  Once we were done with the condiments my father and I walked down the boulevard to find a public bench to eat our tacos on.  After sitting down I quickly dug in.  All three of them were delicious!  My favorite of the bunch ended up being the steak, followed by the chicken and lastly the chorizo.  The chorizo was the lone disappointment of the meal as I feel it lacked any spice at all but it was still pretty tasty.<br>- I met my friend Melanie H for dinner this evening and we really enjoyed our meal... we had great service - our waters stayed filled throughout the time we were there, and our food was served promptly. Our server checked on us several times as well.  We started with vegetable pot stickers and requested that they come steamed.  They were delicious! Next, we shared 'Indian Curry Vegetables' (I ordered it with shrimp) and Indian Vindaloo Chicken.  Both were extremely tasty - fresh veggies, chicken, and shrimp in really flavorful sauces with just the right amount of spice.  The curry vegetable dish came with broccoli, mushrooms, carrots, snow peas, and long beans.  The chicken dish had tomatoes and onions. We also had steamed white rice.<br>- AZ isn't known for their BBQ but Porkopolis was as good as places I've been in Nashville and Texas for sure. My one dislike (and this is a subjective, personal preference thing) is that both of their sauces are REALLY, REALLY sweet. The spicy is a total sugar bomb and something I honestly couldn't have more than a drop of. Fortunately, the meats were delicious on their own and really didn't need any sauce. My suggestion would be adding a Texas style tangy sauce for those who aren't sugar lovers.<br>- In addition to pizza and chicken, the salads and sides are delicious!  I'm a fan of the potatoes and the cauliflower as well as the Garden Chop Salad.  Lots of fun sauces too!  <br>- Every one dish was amazing. My favorite was the spring salmon. It was cooked perfectly. Salmon was moist inside. The sauces goes really well with it. Fried potatoes were delicious. Not too much dill pickle sauce that over power the potatoes. It has jalapeno in it but I couldn't taste the spiciness in it. hanger steak was good as well. Gai lan was interesting. The mushrooms in the gai lan was like jerky style. But they were delicious and not hard or dry.<br>"},
    {"id": "great", "group" :2,"content":"- While we were waiting for our order the server brought out a small plate of chicharron with dipping sauce. It was a great way to pique our appetite and had a lovely presentation. Our entrees looked even more beautiful, with a well balanced presentation and mix of colors. My octopus crepe was served on 3 small crepes open faced. Because the crepes were thin, and the filling plentiful but crumbly it was hard to get a good bite of filling with crepe. I loved the presentation but I think having a more traditional folded up crepe would make it easier to eat the dish. In general the octopus was tender and flavorful but was slightly chewier than the amazing octopus dish at Virtu and Nico's Heirloom Kitchen. The chorizo in the dish was decent, but after a while I was wishing there were a slightly sweet element in the dish to balance out all the salty flavors. Perhaps a small squeeze of orange would help brighten up the dish.<br>- Overall, we had a good dinner with great service.<br>- Defalco's is the kind of place I really miss from the Boston area.  Down to earth guys, a variety of good Italian deli meats, salads, cheeses, a nice selection of Italian grocery items, and great sandwiches.<br>- Clearly, this place has gotten better (hence the million check ins). Their brunch is legit. It may be one of the best in town. The biscuits and gravy are so rich and sinful (they make a southwest ish version.... it's great... you need it in your life)..... you can definitely share this dish. The benedict is awesome, and the eggs are always perfectly cooked. Their monkey bread is insane, but so sweet, it's hard to even eat them between two people... you need a group. Their french toast is delish and it comes with bacon.... so good! The last time I went, I had their spicy noodles with raw egg yolks for breakfast....this sounds so gross.....it was amazing! I'd highly recommend Joe's for brunch.<br>- Very good pizza by the slice and great service and people! Quick, inexpensive, and tasty meal.<br>- It was a fun evening with a lot of laughs, some good food, and good beer and wine or so my table mates told me.  I managed to get a table near the front and next to the three tables where the chefs and their friends sat.  What a great way to help Three Square and get to see and hear the chefs we know and the critics we read.<br>- Note: This review is just for their bar and live music space downstairs--I did not try any of their food. The bf and I were looking to see if there was any live music going on around town and found out that the band Andrew Jackson Jihad would be playing here so off we went. What we didn't think to do was buy tickets ahead of time, and we found out that the show was sold out, wah wah. However, the guy at the door told us that they often have people who need to sell a ticket so if we wanted to just hang out at the bar for a while we might luck out. So we plunked ourselves at the bar and proceeded to down some Canadian pints, which turned out to be 20 oz--4 oz more than standard US pints. Mind. Blown. Sure enough, after about half an hour, some people who needed to sell tickets turned up and we were in! The music venue is downstairs, in a pretty spacious basement-like space. The place was filled with young Calgarians hanging out and enjoying themselves, and we really liked the vibe--chill and casual. The sound was pretty good, and we enjoyed the bands a lot. All in all, we had a great time and would definitely go back if we ever find ourselves in downtown Calgary again!<br>-  This shop is very close to my apartment, walkable for me. The coffee is really good. It is from a local roaster in Tempe. Additionally, the people who work there know a lot about coffee. The guy with the darker hair who works there is very interesting and has worked in the coffee business for several years. The owners are hard working and great at making delicious lattes. Everyone is friendly. Additionally, the decor is super cute and the furniture is comfortable. I have never had a bad experience here.<br>- We're fans of Bahama Bucks, especially during the summer.  Ordering can get a little overwhelming because of the amount of flavors and possible combinations.  What makes Bahama Buck's so good is the amount of flavors they have, the creamy texture of their shave ice, and the great customer service.  I'm a wuss and my body can't handle too much sweets & ice cream. So, I keep it clean and simple.  My order is usually a baby size Thin Ice Birthday Cake & Vanilla with their sugar-free Vanilla ice cream.  All Thin Ice flavors are calorie free and their sugar-free vanilla ice cream has only 100 calories. This is perfect for me, especially when I'm cutting down my calories and have a sweet craving for something cold.  <br>- Pretty good pub atmosphere, great chips and pretty good fish, especially for the desert.  My fish could best be described as a plank.  Three good size Cod fillets that were bonded together by the beer batter.  In the traditional English style, I prefer the Haddock fillets but you really only find that in England and New England.<br>- The price went up a buck to $7, but it's still a great deal.  I also tried their $6 pork belly happy hour plate, and that was also really good.<br>- The arugula was great--leafy, peppery and nicely dressed in a light vinaigrette (you often get dry arugula on flatbread).  The generous portion of the arugula kind of overwhelmed the small portion of prosciutto, but the prosciutto was good (not dry, meaty and with the right amount of saltiness).<br>- Service by Lauren was great.  She was personable, nice, knowledgeable about the menu, and very attentive.  The food also came out at a good pace.<br>- I've been here several times, but I never reviewed it before.  We went here tonight and had a great meal.  Standard chips and 4 salsas were brought.  The salsas are tomatillo, fire roasted tomato, regular tomato salsa, and a bean dip.  They're all good, but my favorite is the fire roasted.<br>- It was awesome that my stay was during Chinese New Year/Tet/Sol Nal, because there were so many beautiful gardens and decorations celebrating the year of the lamb/goat.  With that, more than 50% of the gambling tables were filled with people celebrating the Lunar New Year and hoping for good luck.  There were some people even praying to the goat statues and fountains.  Also, there were many open Asian restaurants in the hotel serving, to my surprise, authentic style Hong Kong, Vietnamese, and Chinese dishes.  While the hotel restaurants are waaaaaay more expensive than they should be, the food was great quality and the service outstanding.<br>- We came in on Memorial Day and took advantage of the happy hour taco menu - the skirt steak and braised pork with pineapple tacos were super tasty and a decent size.  We started with the street corn queso and ate it all up...it was really good!  The patio is great and pretty large, the service was friendly and the food was good.  We had a few issues with our order, but they rebounded and made it right.<br>- They had some good Chinese food (gai lan!), meat carving station, rotisserie chicken, made-to-order taco station, large selection of seafood (including snow crab legs and crawfish).   Unfortunately, sushi wasn't impressive, as the rice was heavy and hard (I tried a roll) and the fish (nigiri) looked like it had been sitting way too long.  (Perhaps it was the lateness.)  Although the Hijiki seaweed salad was delicious!   Pizza was great, especially when it came out fresh out of the oven.  And of course, the salad bar is great, too.  (I have no idea why, but I always want salad.)   <br>"},
    {"id": "healthy", "group" :2,"content":"- The menu spans healthy to indulgent, but I especially appreciate that the food they serve is tasty. The smoothies aren't chalky and the bowls aren't bland, and if you want real food they also have panini sandwiches too. Prices are reasonable for the portion and quality, and they do offer combo options and seasonal specials. Check their social media for discounts like their current weekday afternoon happy hour!<br><br>- Talk about making healthy food fun and tasty, this place does just that. It is an upscale casual, and is on the pricey side for casual, but you are paying for your health. The dishes are all sourced from local farmers and you can taste it. Even for someone that is not used to eating healthy, there are things on the menu for them.<br><br>- It was still tasty, but I misjudged the ratio of filling to lettuce leaf and had too much filling left. Not a bad problem because it was good all by itself, almost like a moo shu pork without the pork. Frankly all the dishes sound good here. Healthy too with a bit of an Asian accent on a lot of them like Teriyaki Quinoa and Spicy Panang Curry. The salads looked appetizing as they passed by, especially the $14 one that featured seasonal ingredients like asparagus and broccolini. The place was pretty packed for a weeknight with fit and aspiring-to-be-fit Phoenicians. No matter what end of the food pyramid I was eating, I just like what Dr. Weil has attempted to do here since the menu combines healthy and tasty in a refreshing way.<br>"},
    {"id": "fresh", "group" :2,"content":"- Great service, fresh tasty food, good drinks, romantic ambiance, live music in the back courtyard - we loved it all. Highly recommended over many other spots to eat at in the area, and I feel it's even better to come here without children at night if looking for a more romantic and adult kind of dining experience.<br>- Banchan were fresh. Bulgogi with Rice, Soon Tofu and Dumplings were all tasty. <br>- A great glass of French red to start with and for some reason, I was offered seafood to go with it. Okay, I rolled. An order of crab legs, which were messy but well cracked so that I mostly just had to dig out the meat. It came with a small pot of clotted cream, which probably made sense to the head chef but not to me. I enjoyed it anyway. Second dish was a sea urchin, which I'd never had before and it was quite tasty and fresh.<br>- My wife had the Greek salad and pronounced it excellent. Loaded with feta cheese, anchovies and lots more stuff than lettuce, she said it was fresh and crisp and very tasty. The included pita bread slices were excellent.<br>- We have been to all of the recent iterations of this bar - World of Beer, Wasted Grain and now The Funky Monk.  We stopped in this afternoon for a drink and to watch the NBA Playoff game.  The bartender welcomed us in and checked on us periodically, the bar was quieter than all of the other area bars, but maybe because it is such a new concept (or maybe more of a club at night), and they have a pretty extensive drink list.  I settled on a cherry lime mule and loved it - well mixed, refreshing and so tasty!<br>- Making everything small batch, the Fudge and Chocolates admittedly quite tempting, there was simply no way to pass on the Sundae named #1 by Cleveland.com investigators, a tribute to the late Indian's Right Hander featuring fresh Caramel Corn atop Salted French Caramel Ice Cream with Hot Fudge and Spanish Peanuts, everything from the textures to sweet and salty balance on-point at a bargain basement price of just $7.00, an equally tasty Chocolate Chip Cookie Bar saved for later offering up crispy edges and a thick, soft center.<br>- The mozzarella wrap was large and tasty, and served as an excellent vehicle for that amazing garlic ranch sauce they have, but the taste of the cold chicken was more subdued and the grill-fresh char flavor was rendered almost absent. It's a good healthy-ish option though, but I might opt for a salad instead next time.<br>- A good place for dim sum. All the dim sums are made to order and all fresh and tasty! I prefer the made to order VS the pushing carts!<br>- The bartender was nice, knowledgeable and made a mean mojito and french martini. I got the Honey Wasabi Tuna Burrito and it was fresh and tasty. It was refreshing to get a fresh Mexican style dish instead of something fried and cheese ridden. It was flavorful but the flavor didn't overpower the fish at all. We got the chips and salsa but the salsa wasn't anything to write home about so I would skip on that next time. <br>- Did I get my money's worth? Yes. The fish is fresh and tasty. It's not a massive selection and it's not tremendously high end, but what they do is very good. I'm a fan!<br>- Single (ENORMOUS) slice with a drink is $5.99. It's a HUGE slice and delicious! They give you a pizza cutter with it because they recognize that it won't be an easy task to eat it with your hands. The employee was extremely fast and helpful. The pizza came out quite quickly and Tasted fresh. Topping were pepperoni and sausage and were tasty, too. Top notch fast food pizza shop compared to its competitors.<br>- Just like the name implies, Joe 2 Go is a family owned and operated mobile coffee house. They have hot, iced, and frozen coffees along with a selection of smoothies and a few protein shakes. Service is friendly, drinks are tasty and made fresh. Props for having sugar-free syrups and soy milk available for those with dietary restrictions!<br>- The husband and I went to Modern Marg for a pre event happy hour. The bar itself is comfortable, with big cushy bar stools. The bartender was friendly and efficient, though his descriptions of the drinks were a little lacking (I asked which of the happy hour margs he would personally get and he replied ' uh, if you want agave nectar get this one... etc, not answering the question, just naming the ingredients, which I already knew). I had the Modern Margarita, which really tasted like tequila on ice. This was ok, especially for only 5$, but not the tastiest marg by any means. The husband had the Victoria beer on tap. The bartender was enthusiastic about this beer, so that was nice, and with good reason, because it was exceptional. We also had the salsa flight, which was very good and satisfying. The smoky salsa was tasty, almost like a bbq salsa, but the best of the three was the pico, which was just the right amount of spicy for a pico and tasted very fresh. The tomatillo salsa was lacking, not amazing. The salsas came with the largest basket of chips I have seen in a long time. We felt like we ate a full bag of chips, and the basket was still half full (yes, I am an optimist). This place is way out of my usual 'hood, so clearly it isn't a place I would frequent, but if they are in your 'hood, I would check them out for happy hour.<br>- Everything else we tried was fresh, tasty and original.<br>- Turn your AC up higher please. The place is small and cramped, almost like cooking and eating in your one bedroom apartment. The food is good, but if it is the summer and the place is full, then it gets hot, so get your food to go. The chicken breast pita was very tasty as this chicken is marinated in some serious herbs and spices. It is a simple pita, but the size of the $7 pita makes it quite filling and the freshness of the ingredients makes it top notch.<br>- Tuna sashimi was fresh and tasty and even my grilled asparagus was perfect.<br>- Delightfully surprised!  This place doesn't look like much from the outside in an unassuming strip mall.  Inside, you enter a 50's diner theme and the staff is amazing friendly...from the cashier to the cook who brought us our food.  The food was so tasty and reasonable!  The single burger with 1,000 Island and cheese was a little messy, but totally worth it.  The fries were fresh and so good too.  I will definitely be back when I am in the mood to eat all of my calories for the day in one meal!<br>- Prices are very reasonable here, with tiers for classic style (basic) donuts, a second tasty level with upgraded toppings or frostings, and fancy donuts ($2.25/ea) that are competitive with what other local spots are putting out, riffing on Girl Scout Cookie flavors and mixing in candy flavors. Favorites for me were the red velvet with cream cheese frosting and sprinkles, the Samoa flavor, S'Mores (great marshmallow fluff frosting!), and the aforementioned PBJ special. The apple fritter I sampled could have used more apple and the Blue Magic (blueberry + cinnamon toast) was understated and underwhelming, but overall most donuts had great rise and weren't too sweet. I'll have to come back for the El Jefe, with horchata frosting and a fresh-fried piece of churro!<br>- The newly renovated Ping Pang Pong not only looks great but they are serving up fresh and tasty dim sum. It's important to go during peak times to ensure the food carts are plentiful and replenished regularly. The food stays fresh which is key. <br>- I stopped in for lunch on Saturday and had a great experience.  The couple that owns the place is very friendly, the food was fantastic and I LOVE the luncharitas (fresh juice) served in a jar.  The citrus berry was absolutely delicious...I am seriously going to crave this stuff every day!  The chicken dilla was quite tasty - the salsa was legit too!<br>- I also got an order of summer rolls which were quite fresh and tasty after a ten minute car ride.<br>- Accommodating, affordable and tasty. The sopes and corn tortillas are made fresh and taste like they are. I ordered two Chorizo sopes and they were really good. The chorizo was seasoned well and the corn patties had a nice crunch to them. The beans were ok but the rice was awesome. I also tried the carne asada quesadilla and it was great.<br>- Oh so tasty, with excellent vegetarian and vegan dishes that can taste better than the original meaty versions.  The no harm chicken parm was excellent, with perfectly crisp breaded seasoning, flavorful tomato sauce, vegan cheese that was a very close texture to mozzarella, on a soft fresh bun.  I also tried some of the buffalo wings, which were tangy, spicy, with a nice texture similar to chicken.  I was surprised to discover that the wings are actually made from mushroom, but that explains why it was so good (I love mushrooms).  While I'm not exactly a vegetarian, I have friends that are vegetarian and vegan, and I do appreciate good food when I taste it, and will definitely go here again to try more dishes.<br>- The Mushroom taco was surprisingly tasty! I love their fresh made in house soft shells, so soft and with a good bite!<br>- The breads are all made fresh on the spot in their brick oven and only took a few minutes to make. The zataar with cheese had a great balance of the zataar spice with cheese and the flatbread was lightly crisp. The safiha armani was also tasty, with an even layer of well seasoned ground beef with vegetables. I enjoyed the spinach pie as well. It had a generous amount of spinach with a tangy flavor (I think maybe there's some pomegranate in it). The flatbread was $2.99 and the spinach pie was a whopping $.99. :D<br>- On the day we visited it was a stunningly clear sunny day. Before heading into the Heard Museum we decided to grab some lunch here. Perfect choice! Started with the prickly pear lemonade. Only $3.50 for a large glass and our waiter brought over a carafe of it for our table. We ordered two of the most delicious sandwiches. Turkey, brie, and sliced granny smith apples on toasted walnut cranberry bread. Panko crusted chicken sandwich with fresh mozzarella, tomato, and pesto sauce on ciabatta bread. Both were quite big and filling for only $13 each. They came with a side garden salad or quinoa salad. The waiter told us the quinoa salad made with with black beans was a favorite and we could see why - it was mighty tasty. <br>"},
    {"id": "yummy", "group" :2,"content":"- After being on my bucket list for awhile, I finally made it out to El Chorro for happy hour yesterday. This place has a legit happy hour! Everything on the HH menu is 3$.... that is crazy! We had decent margaritas that were on the strong side (3$), split the sliders (3 sliders and fries for 3$... and the meat was good, juicy and seasoned with onions... really yummy stuff), and the sticky buns (pretty standard sticky buns). The food was tasty and inexpensive... the portions were large. I wouldn't hesitate to recommend this place for HH and I know I'll be back!<br>- We started with a lobster bisque. I was prepared not to like this, as I don't love lobster, but this was sooo good. Creamy, velvety, and not too fishy. It was served with a piece of toast that soaked up the broth...really good. Secondly, we had the same salad as the last time we were there....but it wasn't the same. It had the same components, but it was made correctly this time... last time it was just a piece of brie, with plain undressed arugula, plain nuts and a big piece of poached pear.... this time the salad was dressed perfectly, it had a thin slice of poached pear and a slice of poached apple and the brie was grilled (I think....)... it was so much better. For main dishes we had a filet topped with crab and a bearnaise sauce served with cheesy delicious potatoes, beets which were....beets, and nicely cooked asparagus and sea bass topped with cucumber and avocado served over red quinoa cooked with bacon, roasted carrots, and a delicious sauce (this was super flaky and delicious....the husband liked it better than the steak which is very unusual). Dessert was also tasty, it wasn't what it said it would be on the menu (was supposed to be chocolate espresso, but was a vanilla cake of sorts with several different yummy sauces like caramel and chocolate and served with fresh fruit...the best part? The nuts... really well toasted and added just the right amount of flavor). We weren't offered/didn't get coffee, but that was ok. Additionally, we had our dinner over 1.5 hours... I feel like that is an appropriate amount of time for a coursed dinner, so that was a great improvement. After this experience, I can see us giving this restaurant another chance... we will be back!<br>- My order the Wonton noodle soup and the Hainan chicken. Wonton noodle soup was just OK at $4.95. The bowl was large broth needed additional seasoning and the Wonton's lacked shrimp. I've had much better in So Cal but the Hainan chicken was a hit! The rice was so tasty, good portion of fresh chicken, yummy dipping sauce and pickled chicken may this entree a hit and all for $5.25 <br>- Came here with some friends on a saturday am after a LOOOONG night out to grab some comfort food to make up for the lack of sleep. Ordered the chicken waffle and pancakes to share. Both were nicely presented and was very tasty. I especially liked the freshly pressed antioxidant juices that we got, so yummy! We got each one of the red and green, highly recommend those. <br>- A friend and I came here last Friday night before going to the Summer's End Music Fest. The only disappointing part? I bought tickets to the music fest when I could have heard the entire concert from this bar! This place is right across from Tempe beach park. The bar is nice, much more modern than the inside of Monti's. The happy hour has some great food specials- many items for 7$ each. My friend and I shared the Texas toast slider things (really just a burger cut into 4 pieces) and the prime rib tacos. The tacos were yummy... fresh tasting with just enough spice. They were very meaty and overflowed with toppings... would definitely get again. The burger was also delicious. It was a burger on texas toast with bacon, roasted jalapeno, and fried onion straws.... how could that be bad? Additionally, they had a special for the weekend of 5$ margs, and they were solidly tasty margs. The service was attentive. I would certainly recommend!<br>- We got lunch first before shopping. I kept telling my husband that the tacos are really good here; back at my credit union days, the girls always ordered tacos once or twice a week (from the DI one). I chose a chicken taco and a carne asada taco (think street tacos), and hubby got the carne asada burrito (pretty big), plus rice and beans for the little man. There is a salsa bar on the side, with a sign stating it's only for customers at the counter. The specials are written and posted on top of the main menu. Overall, the meal was tasty (no grease), our boy ate up the rice and beans (yummy), and hubby was surprised that it was good. <br>- Service was exceptional, our waiter and assistant checked in regularly and made sure we received  refills on bread sticks and or salad - both items were yummy. My order the Chicken Scampi - chicken breast tenderloins saut챕ed with bell peppers, roasted garlic and onions in a garlic cream sauce over angel hair. The chicken was tender  and the entree was tasty and filling. I couldn't  finish all of my entree BC I ate to much salad and bread but still enjoyed it. <br>- Patisserie Rhubarbe is a small little dessert shop, tucked away in a neighborhood off of De Lanaudiere.  This cozy cute cafe offers a variety of pastries, freshly-baked on a daily basis, including croissants, breads, individual slices of cakes and tarts, as well as hot/cold beverages.  I tried three of their items: the cheese scone (not too dense, a lovely cheesy taste, with a bit of a salty side to it - it was pretty yummy), a zuchinni bread (honestly, I got this because of it's interesting and cute shape; it was topped with a lemon-like glaze with some poppy seeds - the zuchinni bread was tasty, slightly sweet, with an interesting complement of the glaze), and a lemon tart (this was absolutely delicious - the lemon filling was citrus-y with a bit of a tang and sourness to it, with a creamy whipped top - it was really pretty to look at, too!).  Service was super friendly, and complimentary water is served in glass milk jars.  They also have free wi-fi, so you can sit, relax, enjoy your treats, and/or do some work before you're on your way.  I highly recommend!<br>- I went here with the BF and a couple of our friends tonight for dinner and it was mighty tasty. I'm very glad I looked at Yelp before going so I knew where this place was because otherwise I would've been very lost. The place is extremely small which makes it slightly uncomfortable (like everyone can hear your conversation and you are sitting very close to other parties) but don't let this scare you off because the food is very good. They give you free bruschetta (essentially) which I thought was the best part of the whole meal....so good! The bread was light and delicious and the topping was vinegary, oniony, and fresh tasting....super yummy. We all kind of shared food, the BF and I got the meatball pizza which was tasty, but a bit heavy on the meatball (can I even say that? ha...) it was thin sliced pieces of meatball on top of a basic cheese pizza. The crust is very good and the sauce is also very fresh tasting. The pizza could have used some basil or something to make it have more depth of flavor, but it was good as is. We also shared the gnocchi which are made in house and were light, airy, and delicious! I love eating places that make their cheese and pasta in house....very cool. Our friends got the penne with vodka sauce which was super bacon -y but good. I couldn't eat a whole plate of it (too heavy) but it is extremely flavorful. They also got a pizza and really enjoyed it. Although I wouldn't say this place is the best pizza in town, it is very good and I would love to eat here again. <br>- Peanut Butter Milkshake: VERY tasty. It was rich and peanut buttery and oh so yummy<br>- We munched on the chips and really yummy corn salsa and my glass of wine was delicious as well. When our food came out, the tacos were larger than I had imagined. Unfortunately they forgot to put the sauce on the side, but I liked them both!  The salmon was my absolute favorite, fish was cooked perfectly and the sauce was superb. The lemon shrimp were tasty as well, and all the trimmings inside the taco were a perfect combo. The avocado pasta salad reminded me of a pesto pasta but it was really good. I demolished my entire meal to the last bite!<br>- Food was great!  I cleared my plate of Salmon and Cream Cheese Omelette - so yummy!  And the Bread in the coffee cup was so fun and tasty, too!<br>- Very creamy custard so yummy: three flavors, vanilla, twist and chocolate plus other tasty treats, italian ice, a blend called a gellati, quarts, sandwiches and even a cake too (all of these items are in the case). Signed up for the e-club (there is an app) and got a BOGO coupon (any free item). Toppings: 75 cents. <br>- The food was great, though. The trio of salsas were well worth it. You get red salsa and chips complimentary. But add the $5 trio of salsas and you get habanero salsa and two green salsas. All were tasty. I opted for the pulled chicken enchiladas with mole sauce. They were yummy. Not anywhere near the best I've ever had, but they got the job done. And bonus, the sangria was tasty too.<br>- We stopped in yesterday after reading the amazing Yelp reviews and certainly weren't disappointed!  This ice cream is just so yummy.  My husband had the lemon sorbet (some of the best ever), I had the honey lavender (unique and so tasty) and our dog had a scoop of free vanilla ice cream (love that they are so pet friendly).  The owners are so friendly and genuinely grateful for the business...we will definitely be back again and again!<br>- The service was fast, the staff was friendly and the food was reasonably priced and quite tasty.  We enjoyed the gyro with potato salad and a tuna salad sandwich with potato salad...yummy!  We look forward to coming back in cooler weather to check out the rooftop patio.<br>- It was the lunch hour and Chicken Shack was rockin although I had no problem finding convenient parking. I opted for the six wing combo which included shoe string fries and a beverage. Service is prompt - within minutes my entree was brought to my table and I was taken back of the size of  the chicken pieces served. I chose chipotle sauce on the side which was tasty and the fries were also yummy. The portions are generous here and I couldn't finish all  the fries.<br>- I tried a fried chicken sandwich which turned out to be positively gigantic. It came with a yummy secret aioli and also came served with a nice helping of tater tots. It all washed down well with a couple of glasses of beer and cider - here, it's worth noting that they have quite the good boozy selection. There were many other tasty-looking items on the menu like jerk turkey burgers, beet salads, strip steaks, and flatbreads that I didn't get to try, but if you're stopping by, it'll be worth coming with a small group, getting a bunch of different things, and having everyone share or at least mooch a bite off each other's plates. <br>- I called in the afternoon and had no problem getting a reservation.  Julie who answered the phone was really sweet (always a good sign), and Matt, our server, was extremely personable and attentive.  We had a group of 8 - including a few picky eaters.  We started with chips (which are house-made) and salsa, guacamole, and grilled shrimp & guacamole tostada bites... On top of that, the GM brought us over the beef tostadas and shrimp & pork dumplings - this was a very sweet gesture and much appreciated - we finished every last bite of both!  The dumplings were cooked to a golden brown and really tasty.  The beef tostadas were yummy also; I think these are both new menu items that are being tested - hopefully they will stay since they were both pretty impressive!<br>- Although the restaurant was not busy, our food took forever and a day to come out. When it finally did I was pleased with my dish, as it was a good amount of food for the price. The salad was tasty, and they brought my blue cheese dressing on the side. The chicken mushroom soup was pretty tasty, and they give you a huge cup of it! My BLT however...the bread was so badly burnt, I didn't eat any of the bread. Also, I like my bacon chewy, but these were burnt to a crisp. Stole some of my friends' fries and dipped it in their yummy ranch so I got my fill of carbs.<br>"},
    {"id": "nice", "group" :2,"content":"- Tiny, neighborhood place that is actually quite nice!  5 tables inside and about the same outside.  The brunch was pretty good...nice, friendly service and tasty food.  This place is a nice change from the other downtown restaurants.  The dinner menu looks pretty good as well, so might have to go back and check it out.<br>- We ordered a bunch of dishes on the HH menu to share. The portions are relatively small, but the prices are reasonable compared to the other sushi restaurants on the strip. The flavors are creative, presentation was nice, service was fast and efficient. We probably ordered one of each item on the pretty extensive HH menu, and enjoyed every dish. Drinks were pretty tasty also.<br>- With the seated area outdoors, I was enticed to eat outdoors that day.  I was about to leave back to Chicago on this day, but thought it would be nice to get some healthy food and check out a new spot.  The interior is pretty open and functions without the need for a waitress, but not like a fast food joint.  They have quite an extensive menu for a healthy food spot.  I thought it might even be just vegetarian, but it's not.  My coffee wasn't very good because I had her add in the fat free caramel syrup, so that was my own fault.  So many things sounded good here, and I ended up choosing the steak and egg scramble.  It was a pretty nice portion and tasty.  I could totally see myself coming here after a good workout or something and feel good about myself after choosing anything to eat here.  The prices are decent, and the service was alright.<br>- I know the owner through a friend and this place has reopened under the name White Cup Coffee. Sherrie is the owner and she is a very friendly and nice person and obviously has a bunch of regulars who come in daily for drinks and breakfast and lunch. It is family friendly as well as I have seen alot of moms toting kids after working out and there is never usually a line at any point of the day. I cannot vouch for the food yet, but she does have a daily special of the day (It was meatloaf today for $5.95) and a bunch of sandwiches including her famous egg salad. I usually have some iced beverage and my order has either been the Mocha Frappe or the Iced Mocha, both for about $4 each. They were very tasty and she doesn't skimp on the size either - they are all  large. You can sit at the counter or pick among smaller tables, couches and even an easy chair or take your stuff outside to the tables there. It's in a strip mall, but the White Cup Coffee sign is very visible and it's next to pizzeria. This is a great alternative to chain places and if you go in there enough, Sherrie will make you feel like one of the family and her family is always in there too.<br>- Review: I was trying to decide between two and three stars because we went here for our fancy anniversary dinner and I really REALLY wanted to love this place! Unfortunately, it was disappointing. I'll start with the positive stuff, because there were lots of positives- 1. Chef Chris was super nice and friendly 2. I love the environment, we sat on the patio and it was beautiful. The tables were candlelit, there was a pretty fountain, and I LOVED the little wood burning fireplaces and the nice smell that the wood gave off 3. A lot of the food was good. We started with a very tasty minestrone soup with home made crackers and the dessert (pumpkin cheesecake) was also wonderful! I also liked that they put mint in the water and the coffee was very good.<br>-  So now on to the not so great parts... So first, we had tried to go to this restaurant for my birthday in April, but a couple days before our reservation, the BF got a call saying that chef Chris had fallen ill and that we would not be able to have dinner there BUT that they would call us as soon as he came back to give us a reservation then. Well, I waited a month after my birthday... no birthday dinner.... cuz all I wanted was to go here. No call. The BF called and left several messages with no response. Then the message changed and they were closed for the summer and we went somewhere else. That was pretty bad. So now we got a res for our anniversary, and I was super excited but things went so wrong. The main dish was not at all impressive. I was told that one entree was chicken in a creamy sauce with black rice and spinach and I ordered that. The BF got a beef tenderloin with pesto, potato, and spinach. Well... they came out and my chicken and his steak were identical...both with pesto, spinach, grilled potato. That irked me a little bit, but I just figured that it was an honest mistake on the waiter's part. Then I took a bite of chicken and it had a gelatinous texture... I have never experienced that before, but I thought maybe it was just so juicy and I have never had chicken prepared in the same way before...Wrong. Then I took another bite and the texture was just weird. I tried to see if it was pink inside, but we only had the candlelight so I couldn't tell. Had the BF try it, and he said he thought it was underdone. Not a real awesome thing for chicken. So I sent it back and the waitress was very nice, apologized and took it. Chef Chris brought the new one out a few minutes later and was very sweet about it, which I appreciated. However, the chicken was not so awesome. Maybe I was just turned off to it or something... but it wasn't very appetizing. Anyway, it was kind of bland and the sides were not great... plain potatoes and raw spinach and tomato.... nothing special, and definitely nothing worth the price. The BF's steak was chewy but still better than the chicken, but essentially they tasted the same. The worst part, though, was unfortunately the service. I would understand the service being lackluster if chef Chris were doing it all himself, but with two people on waitstaff and only about 15 tables it was unacceptable. We were there for 2.5 hours, which would be fine if that was the intent of the restaurant..but I don't think it was. The first two courses were timely, but dessert was kind of a mess. We got some coffee...cute LARGE coffee cups, but not too much coffee in them and it wasn't hot, but it was tasty. We finished the coffee before we got our dessert. The waiter told us he'd bring some more coffee (us and the people next to us too) he came back a minimum of 3 times without refilling our coffee, probably more. I don't know if it was because there was a big table inside to tend to, but we did not get coffee until about 10 minutes after we finished our dessert and I had eaten slowly on purpose because I wanted to have coffee with dessert. THEN we proceeded to get the wrong check twice (with about ten minutes in between wrong checks) and wait about 35 minutes to get the correct check. There was some confusion between the waiter and waitress on who was supposed to take care of us, but it was a bit ridiculous. For 100$ for two people there are many places that have attentive service and tastier food. So for all of these reasons, I do not foresee us returning to this restaurant in the near future, unfortunately, because there really are some great aspects of this place<br>- One of the best airport dining experiences I have hasd.  The only bad thing is that it is too easy to forget that you are in an airport, and thus loose track of time.  The restaurant is set back from the hub bub of the main airport traffic, and the seating is comfy, and the d챕cor is beautiful.  Plus, under the bar are electric outlets for you to power up your electronic devices while you wait.  The staff were friendly, and the server waiting on us at the bar was very knowledgeable.  The grilled vegetable open faced sandwich was incredible, and the bread was tasty.  The truffles were OK, nothing like Switzerland, but pretty good.  The local port was tasty.  They had a great wine selection, and even had some nice tasting flights of 3 glasses to choose from.  A highlight of the Charlotte Airport.<br>- Could this place be any cuter?  Seriously, what an amazing new place - great atmosphere, friendly staff and an absolutely tasty London Fog = perfection!  I can't wait to come back and try some other drinks and buy some of the luxe sugar cubes too - beautiful and such a nice gift for my tea loving friends.<br>- I had tandori shrimp. Shrimp is served still in the shell but they prepared nicely to eat to peel off. Shrimp had a very nice tandori oven cooked flavor to it, I enjoyed without any sauce as well as some of the sauce. My favorite was green one. They had four difference sauce, each was good.  Basmati rice was very good, I enjoyed it with red sauce. (I don't know what they are but tasty.  I asked for the name but I couldn't remember them).<br>- DESSERTS: Both of the dinner options we tried were visually appealing, but the Tres Leches was the favorite with a toasted meringue topper. The Venezuela Marquesa cake was nicely chocolatey with subtle coffee notes but not served with the crema ice cream I'd looked forward to. Lemon Bunelos from the lunch menu are tasty even without the berry and dulce dips, but not something I'd get again. <br>"},
    {"id": "solid", "group" :2,"content":"- Service was good and attentive. I'm not a Southern food person but this is 1 good solid restaurant worth to check out. <br>- In solidarity with the City of Cleveland's perennially rough treatment at the hands of wealthy people who once owned or played for its sports teams, I'm writing a review of the good old Terminal Tower.<br>- Service is always good. The bathroom is always clean. The rest of the restaurant grounds/main dining area, is always clean. If you can brave it, it's cold right now, there is seating outside, in the front. There is a bar part, too (separate---and yes, you guessed it, I've been to that part, too, years ago, though). And Happy Hour too. The food is solid--- from the pizzas, and must mention that the mini kobe beef burgers are really yummy, too. The salads are really good, too (I wouldn't be complaining about how big they are, either, hahaha).<br>- For our dinner we decided to order a XL cheese pizza and also a large white pizza.  We started with the white pizza and boy did it hit the spot.  The crust was crunchy, the garlic and herbs in the oil sauce were tasty and the cheese was decent as well.  Our red pizza was a similar experience as I imagine the cheese and crust were the same and while the red sauce was good, it lacked a little of the oomph that white sauce had.  Overall though they were two very solid pizzas that I enjoyed.<br>- I stopped by here today with my fianc챕 for a quick slice of pizza for myself.  I had noticed this pizza place before and had wanted to try it but never really had the chance before today.  Inside it looked like your normal pizzeria with a counter to order from, a pop cooler, a display dessert case and a pinball machine which was sadly not on. The temperature inside was pleasant as the air conditioner was set to 66 which was a good change from the stickiness outside.  We were greeted almost immediately on entering and I ordered a plain slice.  A few minutes later we were on our way with my slice of pizza.  I was happy to feel that the box was actually hot and so the slice was properly warmed.  Upon opening it I was also pleased to see that the slice was pretty large.  The pizza itself ended up being really solid.  On it there was a good covering of good tasting cheese which did not fall off the pizza when eating.  The crust was crispy and of medium thickness which meant the slice wasn't floppy.  Finally my favorite part was the sauce which had some good flavor to it.  As a matter of a fact you could see the spices when looking at it closely.<br>- As for the sides? The saffron rice was moist and flavorful, and the mac was solid- not dry, not overly cheesy and saucy, but a good version worth having on the menu that doesn't feel too heavy or contrast too sharply with the other major menu offerings. <br>- That said, whether you dine in or pick up and take it home, the food here is solid, and well worth what you are investing. Like most places, they do not have (or I did not see) dinner combinations, so if you want to get a plate with rice and an egg/spring roll, go for lunch. Dinner will instead be a good portion, and by good portion I mean about as big as your head. If you get the smaller size, they cut back a bit on the meat, and make up the difference in rice. Still well worth it, but you may not have as much for leftovers or to share.<br>- The parking lot at this local strip joint is always full, but the inside is never packed. The best time to come is during happy Hour where all drinks are half off ($3.50 beer) from 7am to 7pm. No cover charge and usually a nice bartender on hand as well. Yes the attractiveness of the women are not Rhino quality, but lately the crop of talent has been quite good. IT's been around for years and is one of only two or three strip joints where you can gamble. Most of the time, the girls aren't hovering around you like the Big Boys, but you can actually have a conversation and not be pressured to purchase a $20 dance (most of the time). The kitchen closed a few years ago and the Monday Night Football buffet usually leaves a bit to be desired, but overall this is a solid local strip joint with friendly dancers and a cool attitude and vibe to match. Last night there were about six or seven dancers and several of them had some crazy great moves on the pole and others had great moves in general. With the NBA finals on the TV or other sports , SAm's is always worthy of a visit at any time of the year.<br>- Ordered the Sweet Home Alabama and the Slide meatball sliders- sliders were solidly average, but I appreciated how they were packed with an additional cup of marinara for dipping. Pasta dish was a good-sized portion with delicious gouda sauce, 7 pieces of barbeque popcorn chicken (a little dry inside), and some red onions. Initially I was a bit apprehensive about this dish, but it really worked. Even the slight dryness of the poultry was easily overlooked by the sauciness of the pasta.<br>- Always a solid choice for a business dinner or quiet conversation.  It's a very traditional dining experience, but sometimes it's nice to have that when you need a break from trendy restaurants where you cannot hear the person across the table from you.  The Steak Brown (filet mignon with garlic, cracked black peppercorn, and Cabernet shallot butter) was ON POINT.  Perfectly cooked to medium.  The sides are generously sized, and the 3 of us shared 2 side dishes comfortably.  Service was solid.  I was shocked that we were there on a Friday night and there were quite a few tables open.  They have a great weekday special that includes an appetizer, main, and dessert (I think) for $19.  I think it's good until 4pm or something like that.  I have been to XO and I think you get a better steak at Hyde Park.  XO left a bad taste in my mouth when I ordered a steak medium and instead I got well done.  Not cool.  Hyde Park always delivers a solid piece of meat.  And a hell of a pretzel roll in the bread basket!<br>"},
    {"id": "menu", "group" :1,"content":"- Convenient spot from Alexis Park Resort to walk over and get a decent breakfast. I had an eggs and sausage with home fries and wheat toast and my friend had the egg and spinach scramble. The food was good (especially the potatoes--they were like tater tots!) and service was nice but the menu was kind of limited. I enjoyed watching all the old 80s music videos on the wall monitors and was pleasantly surprised to discover their 20% off Yelp check in deal (food and non-alcoholic beverages only)!<br>- Figuring I would start right at the top of the menu, I chose the Number One which comes with hot relish, onions, mustard and a pickle spear. It was a good choice. Nice amount of toppings and the bun was perfectly toasted. Don't get me wrong, I'm usually a boiled wiener rather than a roasted weiner kind of guy, but there's just something to be said about that charred flavor! (Next time, I'll read Ben's review and try peanut butter, sriracha, and bacon.)<br>- A delicious update! I haven't been here since they expanded their space and changed up the menu a bit so we decided to try out Crepe Bar for breakfast today. We got here a few minutes after opening (9 AM on Sunday) and there was already a line 5-6 people deep to order! That gave us time to decide what to get at least. There is a good variety of savory and sweet crepes, various coffee and tea beverages, and a small selection of non crepe items. I had the octopus crepe, tried a bit of the tahini chicken crepe, and shared the dulce de leche crepe to finish our meal. <br>- Been to this location several times and it definitely a locals spot to eat. It's very mom and pop feel and they have a pretty varied menu, which was surprising to me.  We had their Mother's Day breakfast buffet several months back, and I have also had their spaghetti (which I've ordered on multiple occasions) - everything was tasty and service has been good each time as well. <br>- For lunch on this day I decided to go with the Valiant burger with a side of fries.  According to the menu, the burger was an 8 oz party with Swiss cheese, grilled peppers, onions and mushrooms.  It ended up taking a pedestrian 30 minutes from ordering until it got to our table which I normally wouldn't mention but with a somewhat fussy 1 year old at our table, it felt longer.  Honestly I wasn't expecting much from it due to its price ( less than $6) and the 2.5 star Yelp rating for Valiants.  So I was pleasantly surprised whenever I bit into the burger and I thought it was actually quite good.  It was larger than I expected as well with ample toppings and a nice layer of Swiss on the top.  The only part that could have used improvement was the bun.  While it was toasted it could have been toasted longer as the bun ended up being soggy and fell apart whenever I ate it.  Their fries were crinkle cut and came out piping hot and tasted pretty good.  When eaten plain they could have used some more salt but whenever I added Franks red hot to them I was happy.<br>- We also got some drinks off the happy hour menu. I tried the blood orange fizz and the mojito with the weirdly spelled name. Moscito? Both were good. My friend got the pomagranate margarita and liked hers as well. These are a good deal for the price.<br>- Tiny, neighborhood place that is actually quite nice!  5 tables inside and about the same outside.  The brunch was pretty good...nice, friendly service and tasty food.  This place is a nice change from the other downtown restaurants.  The dinner menu looks pretty good as well, so might have to go back and check it out.<br>- With the seated area outdoors, I was enticed to eat outdoors that day.  I was about to leave back to Chicago on this day, but thought it would be nice to get some healthy food and check out a new spot.  The interior is pretty open and functions without the need for a waitress, but not like a fast food joint.  They have quite an extensive menu for a healthy food spot.  I thought it might even be just vegetarian, but it's not.  My coffee wasn't very good because I had her add in the fat free caramel syrup, so that was my own fault.  So many things sounded good here, and I ended up choosing the steak and egg scramble.  It was a pretty nice portion and tasty.  I could totally see myself coming here after a good workout or something and feel good about myself after choosing anything to eat here.  The prices are decent, and the service was alright.<br>- They serve four course menu here. They had two options for the soup.  Soup was a bit too salty, we both didn't finish. Salad was very good, I especially enjoyed brussels sprouts. Flavor and texture was just right, I would have enjoyed larger portion of the salad. Nice presentation too with different colors.<br>- Main dish was nicely done. I enjoyed my fish and his steak. Around this time, my wine tasted really good with oaky smell to it. When he looked at the menu, he knew I was going to order fish for my main dish so he chose this wine. It just took a long time.<br>- Service by Lauren was great.  She was personable, nice, knowledgeable about the menu, and very attentive.  The food also came out at a good pace.<br>- We came in on Memorial Day and took advantage of the happy hour taco menu - the skirt steak and braised pork with pineapple tacos were super tasty and a decent size.  We started with the street corn queso and ate it all up...it was really good!  The patio is great and pretty large, the service was friendly and the food was good.  We had a few issues with our order, but they rebounded and made it right.<br>- What a wonderful dining experience. The staff was excellent. The decor is beautiful. The spacious feeling of the dining area is pleasing. And now to the meal. The wor wonton soup was as good as any. I I eat the dish regularly has it just has all the goodies I like in it. The sizzling salmon plate was impressive not often I get sizzling salmon and it was cooked properly and tasted marvelous. Can't wait to come back and test some more of the wonderfully inviting items on the menu<br>- Wow, this place was packed at noon! There was a line almost out the door when I entered. I browsed through the menu while I waited. Having eaten at a Kneader's Bakery when I visited the SLC area, I was interested in trying out the sandwiches and baked goods here to see if the AZ location was as good as my previous experience.<br>- I met a friend at Cleo to enjoy an amazing dinner!  I started off with a glass of champagne while we perused the menu.  The restaurant is beautifully appointed and the service was quite good.  We decided to share a few dishes tapas style and enjoyed everything - the scallops, brussels sprouts, grilled halloumi salad and the lamb kefta.  The extensive menu offers a little something for everyone and I love how you can try so many different tastes during your dinner.<br>- Some colleagues and I stopped by here for lunch recently.  After browsing the menu, I decided on the Kobe Sliders, $10.95 that came with a side of Onion Strings.  The food came out pretty fast.  The Sliders were very good....and the Onion Strings were delish!<br>- For desert, I tried Rasmalai, Indian Cheesecake.  I never had Rasmalai before. In fact I never heard of the name before.  No pictures on the menu, I decided to try anyway as I like cheesecake.  Well, it was nothing like cheesecake I thought. I was actually quite taken back when I first saw it served. It ended up being quite good, very light, perfect way to end Indian meal. I thought it helped me settle my tummy. <br>"},
    {"id": "specials", "group" :2,"content":"- They also offer lunch specials menu, but I would definitely recommend to try all their cakes and pastries instead.<br>- First of all, I swear that I reviewed the Bagel Cafe before. I used to dine here a lot, especially in 2012. Bagel Cafe is very popular, extremely busy during breakfast & lunch, and the service is hit or miss. But one things for sure, the Bagel Cafe has a stacked menu, the prices are better than most, and the portions are huge. Okay, that's three things. I've never had a bad experience with my food at the Bagel Cafe and I usually stick to one of their omelets and of course, the Everything Bagel. Be on the lookout for their specials on the board because you never know. What I tend to crave is usually on that board. Overall, Bagel Cafe continues to be one of my favorite places to go for a big breakfast. Just remember, this place gets busy and what usually comes with that is a wait for a table and occasionally, slow service.<br>- This was a great find - thanks Yelp! Yumminess abound here. Prepare to face tough decisions when deciding what you want. Hint: Don't forget to check the chalkboard wall menu for specials. I missed out on several options by only looking at the menu behind the counter. (Though, that was probably for the best considering how long it took me to made a decision on what to order.)<br>- If you cant find anything on their decent sized menu, make sure to glance at their chef's tasting menu (specials), which are sometimes a better deal and come with a side, like their quinoa apple salad.<br>- Called Pan Asian based on an embrace of several styles of cooking ranging from Vietnamese to Malaysian to Thai, the menu having undergone many changes over the years based on old pictures and reviews found via Social Media, Autumn 2017 continues to see David and Lisa largely focused on Thai dishes such as Drunken Noodles and several styles of Curry, a chalk board of specials hanging overhead adding another five or six choices to a double-sided laminate with prices so low that one wonders how the place continues to offer such large portions without having raised prices more than a few cents over the last few years.<br>- The Mixx is a mix of several different dining options: part bar with HH specials and live music, part sit-down dinner with upscale steak and seafood entrees, and part build-your-own-bowl (and dessert!) setup not unlike a Mongolian grill. All menu prices inexplicably end in .77, for another (unnecessary) added gimmick. The atmosphere and decor are classy but the concept is muddled. <br>- HH: Food specials are limited to about five dishes all priced at $4.77(?), which isn't that great of a deal when the dishes are bruschetta, truffle fries, and hummus. Their regular menu is pricey. The bacon wrapped dates and sliders (pair) on HH are decent deals, and the burgers especially were cooked just right so they were nice and juicy! I'll be getting them again.<br>- My server, Patty, was to my table almost before I sat down (the sign says to seat yourself) and she was back quickly with coffee, a glass of ice water, and a menu.  After looking at the menu for awhile and checking the specials board, I ordered their chili and cheese omelette.  I had my choice of a couple of kinds of potatoes but I went with grits.  I also ordered rye toast.<br>"},
    {"id": "items", "group" :2,"content":"- A delicious update! I haven't been here since they expanded their space and changed up the menu a bit so we decided to try out Crepe Bar for breakfast today. We got here a few minutes after opening (9 AM on Sunday) and there was already a line 5-6 people deep to order! That gave us time to decide what to get at least. There is a good variety of savory and sweet crepes, various coffee and tea beverages, and a small selection of non crepe items. I had the octopus crepe, tried a bit of the tahini chicken crepe, and shared the dulce de leche crepe to finish our meal. <br>- I bought 3 Groupons for this place and took the family here on several visits.  Here are some of the menu items we ordered:<br>- What a wonderful dining experience. The staff was excellent. The decor is beautiful. The spacious feeling of the dining area is pleasing. And now to the meal. The wor wonton soup was as good as any. I I eat the dish regularly has it just has all the goodies I like in it. The sizzling salmon plate was impressive not often I get sizzling salmon and it was cooked properly and tasted marvelous. Can't wait to come back and test some more of the wonderfully inviting items on the menu<br>- Previously quite fond of Kitchen Table during Antonio Nunez tenure, the website now basically a wasteland and infrequent tweets of new plates from Javier nowhere near as exciting as the items created over a year ago, it was largely a matter of the similar location and aged reports that the menu was all over the place that prevented a visit to Served from Chef Matthew Meyer until Saturday morning.<br>- Continuing sweet with two styles of Pancakes, the texture perhaps a bit compromised by the size as they did not look as fluffy as the Buttermilk rounds displayed online, Matt's new Parfait Pancakes were largely a combination of two menu items including a side dish made from Greek Yogurt and Honey Granola plus Berries while the Apple Pie Tempura style was far more impressive, the combination of skin-on diced Apples sauteed in Butter and battered slices a great one-two punch of texture amidst Brown Sugar, Cinnamon and Walnuts that likened a Praline in flavor.<br>- My first visit was for the Yelp Adopt-A-Family UYE, (kudos to Metro for hosting and giving us a sampling of many of your fine French menu items).  We had fun that night... highlights in my eyes were the the Gin Fizz cocktail that Ty L ordered - he allowed many of us to sample it and it was delicious!  (I'm not even a gin drinker).  I also enjoyed the flatbread and fried oysters.  Great wine selection too!<br>- I returned for brunch the following Sunday, and let me tell you - brunch is the way to go!  Between Jared and I, we had three menu items.  I went with the egg white omelette (served with mushrooms, spinach, tomato, and gruyere cheese) - I chose grits as my side and they were even better than the grits I remember eating when I lived in the South!  He had steak and eggs and the quiche.  We both cleaned our plates.  Fresh squeezed grapefruit juice and coffee also made appearances at our table.  Both were great, but a tip to Metro - I prefer my grapefruit juice without ice next time!<br>- The menu items do change daily and also change for breakfast, lunch or dinner.  While they didn't have one of my favorite items this time (Chinese food - sweet and sour chicken), they did have a new item I hadn't had before - a Teriyaki Grilled Beef - amazingly good...the teriyaki wasn't actually too strong, it added just enough flavor to really make the beef flavor stand-out and the grilled flavor was perfect...it tasted like the summer!<br>- Super friendly staff as I walked in for a late lunch around 1:30pm. I haven't been to one in awhile and the changes are for the better. They allow you to taste up to six sauces and seasonings before you order. They also have lunch madness menu til 2pm where my choice was found. It was 8 boneless wings with fries and fixings for $7.99. You basically get free fries and one free wing which saves you about 3 bucks. You can also get two sauces per order. Everything was spot on. Lots of new items and Happy Hour starts at 2pm which is a bonus. Chipotle BBQ seasoning/dry rub was a  tasty choice. Staff is trained well and everybody tries to be really friendly.<br>- We started with four items from the starter section of the menu--babaganoush, lebaneh with feta, kibbeh, and spanakopita.  With the babaganoush and lebaneh, we got an order of laffa bread served very warm in a paper bag.  We cut the bread so each could have half.  I thought the lebaneh with feta was outstanding.  I love feta and it stood out in this dish.  The babaganoush was also very good.  The spices with these two starters was the beginning of excellently spiced/flavorful foods we'd experience throughout the rest of the meal.<br>- The portions are huge - so don't be afraid to share. My favorite menu items are actually the omelettes. They're huge and flavorful (no going stingy on the cheese and fillers here), and they just really hit the spot after a long night of drinking and gaming. 3.5 stars for the food, but add 1/2 a star for the ambiance.<br>- This place hit the mark for a dinner for 12. They hooked us up with a beautiful room in the back decked out with a wall of bourbon and other John Wayne themed items. Service was superb and their Restaurant Week menu was much appreciated. <br>- The restaurant is the same set up as the original location. Ordering stations based on the type of meat you will be ordering. They have the same great salsa bar and menu items, so I'm excited. The al pastor is still my favorite but I have to branch out next time. Elote is also a must. <br>"},
    {"id": "daily", "group" :2,"content":"- The menu items do change daily and also change for breakfast, lunch or dinner.  While they didn't have one of my favorite items this time (Chinese food - sweet and sour chicken), they did have a new item I hadn't had before - a Teriyaki Grilled Beef - amazingly good...the teriyaki wasn't actually too strong, it added just enough flavor to really make the beef flavor stand-out and the grilled flavor was perfect...it tasted like the summer!<br>- I went to Wessen with a party of 4. When we arrived, I was a little worried because the restaurant appears to be just a counter of food. At this restaurant, there is more than meets the eye! You order at the counter and then they bring the food to you in a separate dining room. It was hard to decide what to order as everything looks good. They have sandwiches on the menu all the time, and they have daily special items. Their special items come with two sides. I had trouble deciding what to order because they have so many tasty looking items. I got to try their lamb shank, their curry chicken, their falafal, their hummus, and their baba ganoush. It was all good, but the best part was when they brought some of their chicken in cream sauce (as I had expressed interest in it) just for us to try! Also, the chicken in cream sauce was by far the best item. The lamb shank was also awesome! Their feta...super good. Their falafal was just ok. I would highly recommend!<br>- The wait staff were very professional, attentive, and courteous. The menu and wine list are both fairly extensive. And the list of daily specials was pretty extensive too. So many decisions!<br>- I don't have to have coffee daily, but my students and coworkers notice a distinct difference on the days I DO have it. Apparently I have a tendency to be a bit of a Grouchy John myself. Lucky for me, this truck is occasionally on my route to work and I get to pull over, grab something tasty, and roll in to work a pleasanter version of myself. Their menu is fairly unique, with lots of added flavors and some blended drinks. The mint mocha is a favorite. I appreciate that they offer alternative milks and that they usually have a couple of pastries available for those who also want to grab a snack.<br>- Time your visit for HH, 3-6PM daily- the prices are good and everything we tried from this menu was pretty solid. The fried chicken sliders have mashed potatoes as a topping, which was fun. The glazed brussels sprouts are a good add-on to any meal, more of a side than an app. We especially liked the mac and cheese balls, carbs on carbs yall.<br>- A BYOB located in a rather blue collar part of town the restaurant may seem an odd choice to the unfamiliar-everything about its location, size, and layout seems to say locals only. What those paying attention would realize, however, is that Chef Douglas Dick has twice been a Beard Award Semi-Finalist, thrice been named Pittsburgh Magazine's Chef of the Year, and has been embracing the Farm to Table movement since before most had American's even heard of it.  Locally sourced foods prepared by an internationally educated chef and a menu that changes daily (because Dick goes to the market daily for his products) everything about Bona Terra sounded fantastic.<br>- Owned by Damon Brasch and operated on a daily basis by what seems to be a collection of cute college girls that you might see at Whole Foods or a local Co-Op, most of the things that nami does it does very well, perhaps most surprisingly their vegan take on the Blizzard entitled 'tsoynami,' the rich soy-based ice cream lacking any hint of soy and fixed with any number of mix-ins, some menu staples and other seasonal.  Available 7:00am to 9:30pm I've had them at both ends of the spectrum and honestly prefer them to any frozen shake I've had save for, perhaps, the concretes at Shake Shack - the pumpkin was particularly excellent as part of breakfast.<br>- Taking a seat in the minimally decorated space, The Food Network displayed  on televisions as diners are left to peruse a flip-card indicating daily specials plus a Brunch menu offered on Sundays, it was after perhaps five minutes that plates one and two were delivered from the kitchen, the aforementioned Egg Noodles pan fried in a slick sauce with Ham and a mix of Cabbage, Radishes and Green Onions, the flavor largely that of light Sesame plus a bit of Ginger while the half-dozen Chicken Wings were twice-fried crisp and medium-hot, the meat on the inside plump with a good seasoning of its own and tender but not greasy.<br>- The menu is pretty varied, not just Chinese, but explore flavors of Asia; there is something for everyone- Chinese (dim sum), Vietnamese (lava cake), Japanese (sushi). The following menu types are: street fare, dim sum, salads, sushi, market sides, soups, main entrees: chicken, beef, seafood, vegetarian, noodles & rice. There are also gluten-free selections, kids menu (desserts too), beverage, & daily squeeze, and desserts. Weekday Lunch pairings (just to name a few, ahi poke bowl, chang's lettuce wraps, with soup, salad, or spring rolls; $10.95- $12.50) and wok classics (sesame chicken, miso glazed salmon, beef with broccoli, just to name a few) are for monday through friday, until 4 pm (pricing ranges from $9.50 to $12.50). Also does takeout, BTW. I got a menu for when we get the hankering. <br>- I would definitely be back to try out others food in the menu or getting the daily specials.<br>- Early Bird dim sum special daily from 9~11 with s/m/l  for $2.80 and  the thrifty side of me know I need to come back to try out more items in their dim sum menu!     <br>- YUM, YUM and more YUM.  I am really surprised reading the other reviews here.  I loved this place.  Food was fantastic and I had a hard time deciding what to order.  The tasting menus all sounded delicious, but we decided to order a la carte instead.  I loved the concept of fresh imported fish flying in from Italy daily.  The presentation of the daily selections was interesting, albeit a bit overwhelming. <br>- I had looked at the menu online and decided I'd ask about the daily frittata.  It was spinach with feta cheese.  I like that, but it's nothing special.  I ordered what I'd planned before I went, the Rum-flavored French toast with banana and pineapple served with maple syrup.  The French toast had no rum flavor at all which is good!  It was a simple two pieces of grilled bread - not egg battered and fried - with toppings of sliced banana on one and chopped fresh pineapple on the other.  It was so good that I only used a small amount of maple syrup because I didn't want it to overwhelm the fruit.  Served with the French toast was a small container of fresh fruit.<br>- Next presenting a daily special of hand-cut fries beneath tender shortribs alongside the Croque Panini and Shepherd's Pie that had previously impressed me during visit number one, it was with three grilled shrimp standing in a bed of golden grits that the savories were concluded, the dish reportedly soon to join the everyday menu and a 'must order' if so as both the texture and balanced flavors rival all but the very best down South.<br>- Approaching the hostess stand as I looked around the newly designed space I was quick to find that much like my surroundings the service too at Lo Lo's was far superior to Roscoe's and led by one smiling face at the podium to another at my table towards the back it would not be long before a menu was in hand, water was filled, and a few daily specials were noted - the whole process taking less than five minutes and my order placed within ten, much to my waiter's delight as he noted man, you ordered all the best stuff - I hope you brought your appetite.<br>- 2) Pan Fried Chilean Sea Bass in Garlic Soy Sauce - This was the daily special.  It's on their regular menu, but discounted from the regular price.  It's a thick fillet, not a whole fish, and I'd go with this over the scallops.<br>- Hubs and I rolled into Comet Grill for a late lunch and right off the bat I was super impressed with their specials. Not only do they offer a great menu of lunch specials for $7 each, but they also have fantastic daily drink specials.<br>- They specialize in a daily special menu. Samples for a Friday night included:<br>- Sarpa has a daily menu specials or you can pick from their regular menu. We decided on: <br>- *****  Still not slowing down after two years, both the daily menu and weekend brunch in a continuous state of change aside from a few signatures, CRAFTkitchen remains a standard-bearer for how to do Breakfast right and the whole Valley should hope it remains a trend-setter for many years to come.<br>- Described as an old school Italian Deli but found in a spacious and cleanly footprint on the corner of South Durango and West Warm Springs, owner Glenn Plantone promising the finest domestic and imported ingredients and family recipes taking inspiration from uncle Tony Bolony, guests entering Plantone's from 11am daily can expect warm greetings from nearly the moment they step inside, a 4:15pm arrival finding no other diners present, thus giving the young woman behind the register plenty of time to discuss the concept as well as the menu.<br>- We made our way to our table and were met by our witty and surprisingly down-to-earth and casual server.  Explaining some of the daily specials while handing us our menus the waiter quipped about his favorite dishes, the design of the restaurant, Chef Guia's culinary pedigree, and the multiple celebrities who'd sat in our very seats - Bill Murray and Michael Jordan to name a few.  While clearly intending to impress I actually found our waiter to be a pretty genuine individual throughout our meal - something a bit different for Wynn service which is normally a bit starchy and unapproachable.  <br>- The owners of one of Munich's most famous institutions, the historic Hofbrauhaus, have lovingly recreated it - across from the Hard Rock Hotel - down to the last detail, complete with beers, steins, and brass bands. Stepping through the front door, you leave behind the arid desert air and glitzy casinos of Vegas as you're transported into a world of schnitzel, ale, and strudel, served in a beer hall with ornately painted columns and ceilings, or an indoor garden with chestnut trees and a fountain, by buxom dirndl-clad waitresses with rosy cheeks. Having been to the original, I can attest to the autheniticy of the look, the feel, and the extensive Bavarian menu here. Liver mousse is served with a pretzel baked with dough flown in from the fatherland on a daily basis. If you like sausage, you must indulge in a wurstplatte, overloaded with Viennese franks, chicken and pork links, creamy mashed potatoes, and imported sauerkraut. Pork roast with dark beer sauce and bread dumplings, fried filet of cod with warm German potato salad, and breaded pork cutlet with cranberries are among the other specialties. Three versions of hofbrau - lager, a premium dark wheat, and a seasonal version - are on tap, and German, Australian, and California wines are available by the bottle or glass. Naturally the atmosphere is loud and festive, as if it's Oktoberfest every day of the year. If you're not part of a group, you probably will be before the night is over. As highly recommended as it is totally unexpected for Vegas.<br>- Now housed in newly renovated bungalo with indoor and outdoor seating and lots of character, Chef Claudio is back and Pa'La will not disappoint... you can tell he put his heart and soul into the project and continues to do so with his locally sourced menu that changes daily.<br>- The menu offers shredded chicken, beef, and pork, as well as steak and chicken strips in various forms such as burrito, taco, and salad. There are daily specials such as today's chicken tostada for a little less than $8. <br>- Happy to adapt a menu to the group's preferences, allergies or intolerances, a majority of the 150 minutes anchored by currently offered plates with additional daily Chef's inspirations, it was together with an assortment of Pickles and Fermentations that course one was presented by Chef Howard, the King Salmon Poke immediately attesting to high quality product accented by acid and heat, this theme recurring throughout the evening but never redundant in the way other fusion-y places tend to be<br>- A small and intimate setting with a French cuisine inspired daily menu that based on the local and fresh ingredients in the market for the day.<br>- Declined any form of a check and thus presenting an uncomfortable situation where I emptied the limited cash in my wallet in order to compensate the stellar service I'd originally considered reserving my opinions for a second visit, but evaluating the cuisine and experience as objectively as I can I'll simply say that Hearthstone has the potential to be very special, particularly given its location.  As yet still finding its footing and offering a menu that seems a bit 'everything to everyone' it will be very interesting to see how Light Group tries to bring locals out to Red Rock for such a large and aggressive concept, but with plans for daily specials and prices trending far lower than similar spots on the strip I'd suggest that the average couple could easily compose a great meal here for less than $100 by focusing on small plates and come away very happy, the well-culled charcuterie selection and a cocktail also presenting an option for those looking for an after-work hangout or a light bite before a night out.<br>- Selecting a seat in the shade as my pale Midwestern complexion certainly was not ready for an hour in the Arizona sun it would be mere moments before Cliff would stop by with the menu and a bucket of condiments to inform me of the daily pastry special and to ask if I had any questions.  Requesting a coffee I was informed that the coffee, water, and tea are all help yourself and suggesting I'd need a minute to browse the menu I was told to take my time.  <br>"},
    {"id": "selections", "group" :2,"content":"- It was a lovely late Saturday morning when we ate here, right at opening time (11 AM).  The menu for lunch is all $12.50 no matter what you get, with selections such as pork tenderloin, chicken breast, shrimp, and brie with fennel.  The last two selections are what my friend and I had.  The shrimp was excellent.  It was perfectly cooked, on crispy toasted bread covered with pesto.  There were also pieces of sweet pineapple, sliced cherry tomatoes, and chopped onion to add some more color and tropical flavor.  There was a massive amount of shrimp on the plate, which made this dish a tasty and very good deal.  My friend had the brie with fennel and puff pastry (My description of this, by the way, does not do the dish justice).  All the ingredients were well prepared and very good on their own, but for me, it wasn't as good as my shrimp dish.  <br>- Waking late after the gluttony of Carnevino the previous evening breakfast on Sunday would feature not only the culinary stylings of Mary Sue Milliken and Susan Feniger but also new friend and fellow blogger/local gourmand Clint at Border Grill's all-you-can-eat Mexican brunch.  Having visited the original Santa Monica location with family many years ago and coming away impressed by the food but less so by the service the style of the Mandalay Bay location was decidedly different with a large, open floorplan including al fresco dining and typically professional Las Vegas Strip service delivering selections two at a time as we progressed through 90% of the menu, most of it exemplary in quality considering the $35 price.  Featuring bottomless coffee and beginning with fresh fruit and empanadas before progressing through plates both sweet and savory utilizing organic proteins and produce plus house-made jams, jellies, sauces, and creams highlights of the menu for myself included the fluffy biscuits surrounding peanut butter, jelly, bacon, jalapenos and a fried egg as well as the quesadilla and excellent shrimp and grits but all-in-all it would also be foolish to overlook the quality of the pork belly atop the crispy waffle, clever churro tots, or creamy French toast either - the only problem with these being that I had a real estate appointment and the combination of limited time and so many other choices prevented the ordering of a second round.<br>- WOW! $10 all-you-can-eat sushi for lunch or $17 for dinner, what a deal.  Sure the menu is limited for the all-you-can-eat but the selections are great.  The staff is fairly friendly, not top-notch service but good enough.  The decor is modern and the place is clean.  I've been here a handful of times and never had a bad experience.<br>- Excellent food, the sushi is well done and interesting. Tried many different items and all of them were excellent. The drinks are awesome with a wide range of selections on the menu. <br>- Having heard things both interesting and exciting about Wo Fat and its Hawaiian influenced Chinese cuisine but not yet able to coax a large enough group to make the visit worthwhile it was with great fortune that following donuts I not only managed to gather five co-diners to experience the small East side restaurant, but that two of the folks involved were already familiar with not only Wo Fat from a prior visit, but also the restaurant's style from their years in Hawaii.  Located in a less than ideal location and not particularly attractive from the outside or within it should suffice to say that a visit to Wo Fat is based more on the food than the ambiance but with service friendly and efficient throughout the off-hour it was with tea and water that the meal began, soon to be followed by a half dozen menu selections - most novel, all well prepared, and a few truly outstanding.  Sampling far and wide with suggestions from everyone including our server it was with plethoric portion that each dish arrived and with both the pork and shrimp stuffed kau gee as well as the beef chow funn excellent while cake noodles and shrimp were commendable if not memorable it was in the pork and the duck that the meal truly shined - the former a complex sort of mild char sui with more aromatics and less sugar proving irresistible on soft bao while the later was simply divine, a tender confit of duck beneath crackling almond paste that added just a touch of sweetness for a mere $9.95.<br>"},
    {"id": "fabulous", "group" :2,"content":"- The food was fabulous. Tasty tasty tasty! And there is definitely no skimping on the toppings here. Both the hot dog and fries were loaded up with tons of toppings - just how I like it. <br>- Chocolate Peanut Butter Pretzel (yogurt): 5/5: While you can definitely tell it's yogurt (the texture is different than ice cream), it's a fabulous shoe-in. This particular flavor is chock full of tasty pretzel chunks! <br>- The husband and I decided to come to the Stockyards for his birthday this year, and, I must say, it was very enjoyable! I made a reservation on opentable and noted that it was his birthday. This was not ignored, he was greeted with a 'happy birthday!' and given fabulous service all night. We had a wonderful waitress... I can't remember her name (sorry!), but the service was friendly, funny, timely... everything you could ask for. They start you with a basket of delicious cornbread and biscuits paired with honeybutter and a crudite plate with more than your usual veggies (watermelon radish, jicama, etc). Every entree comes with soup or salad, I had the soup which was seafood chowder and was pretty good, packed full of seafood. The husband had the salad, also tasty with a nice balsamic dressing. For mains, I had a filet mignon and the husband had a new york strip... I had the au gratin potato stack thing and he had mashed potatoes. Both steaks were tasty and perfectly cooked. The sides were also great, mine was garlicky and full of flavor, his were perfectly creamy. After dinner, we were so stuffed, but our fantastic waitress brought out a rich chocolatey brownie with ice cream and a candle..... I can't say we didn't eat the whole thing. Thanks to the Stockyards for the delicious and memorable dinner! <br>- This is classic Americanized Mexican food... super cheesy, mostly fried, and fully delicious. They start you with chips and 2 salsas - green and red, which are both mild and kind of sweet. Now, if you ask for it, you can get a tasty 'hot' salsa, which I liked much better than either of the original salsas. I had a cheese crisp and beef taquitos. The cheese crisp was more crispy and more cheesy than most.... it was a fabulous thing. The taquitos were fairly average, but also covered in melty cheese... overall, nothing special, but tasty. The husband enjoyed his bean and cheese burrito. The bill was under 20$... can't complain about that!<br>- 2 days later we were back at Cafe ZuZu for brunch.  This time the choice of what to order wasn't so easy! Wheat pancakes or homemade granola and fruit?? Decisions, decisions. Fortunately, our uhmazing waitress (wish I could remember her name to give her props) made the decision for me.  She offered to split the homemade granola, wheat pancakes and even a side of scrambled eggs among Gabi and I.  As our food came I had to take a call and when I finally returned to the table my eggs and pancakes were cold. Gabi mentioned that the fabulous waitress did offer to keep them warm for me, but she wasn't sure how long I'd be gone.   Everything was still tasty though- even when cold!<br>- $22 Orange Roughy...I'm always skeptical about ordering seafood in a land locked city, but this perfectly cooked whitefish was delicious! The rich herbal butter sauce complemented the fish fabulously.  The house fettuccine alfredo was a good and tasty pasta, just a bit on the heavy side.  <br>- The upsides: The popcorn shrimp were tasty. Lightly fried, crispy little buggers. The hushpuppies were amazing. Seriously fabulous and some of the best I've ever eaten. And the homemade tartar was out of this world. <br>"},
    {"id": "service", "group" :3,"content":"- We probably eat more at Wolfgangs than any other place inside MGM. Always really good chow and service. Thanks folks. Well done.<br>- Great service, fresh tasty food, good drinks, romantic ambiance, live music in the back courtyard - we loved it all. Highly recommended over many other spots to eat at in the area, and I feel it's even better to come here without children at night if looking for a more romantic and adult kind of dining experience.<br>- Convenient spot from Alexis Park Resort to walk over and get a decent breakfast. I had an eggs and sausage with home fries and wheat toast and my friend had the egg and spinach scramble. The food was good (especially the potatoes--they were like tater tots!) and service was nice but the menu was kind of limited. I enjoyed watching all the old 80s music videos on the wall monitors and was pleasantly surprised to discover their 20% off Yelp check in deal (food and non-alcoholic beverages only)!<br>- Been to this location several times and it definitely a locals spot to eat. It's very mom and pop feel and they have a pretty varied menu, which was surprising to me.  We had their Mother's Day breakfast buffet several months back, and I have also had their spaghetti (which I've ordered on multiple occasions) - everything was tasty and service has been good each time as well. <br>- Overall, we had a good dinner with great service.<br>- Speaking of Bubbles, the tapioca itself in here is a bit rubber and tasteless even though the drinks are pretty good. Milk tea is average but some of the other products taste better, such as Mango Milk with Pudding and Lychee Jelly. I do like the prices, which are larger than anywhere in the area, and for less money. I also love the service at EN, which is always friendly, prompt, and courteous. <br>- There was enough space to stand and mingle before dinner even with the tables set for dinner. The food was good, but probably would have been better if they weren't trying to cook 30-some meals all at the same time. The service was excellent and all had a good time.<br>- Sad to see so many average reviews.  I was so excited to see Chris Bianco opening another restaurant in Phoenix, so had to check it out.  The atmosphere is country rustic, the service was friendly and the food was quite good.  The spinach and swiss chard ravioli in brown butter was quite tasty!  <br>- Very good pizza by the slice and great service and people! Quick, inexpensive, and tasty meal.<br>- Tiny, neighborhood place that is actually quite nice!  5 tables inside and about the same outside.  The brunch was pretty good...nice, friendly service and tasty food.  This place is a nice change from the other downtown restaurants.  The dinner menu looks pretty good as well, so might have to go back and check it out.<br>"},
    {"id": "staff", "group" :4,"content":"- So once we ordered and got our food, i tried their Huevos Rancheros and some Horchata, other friends tried their tacos and burritos and where please too it all fell into place, the food was good and the staff is real nice, the place was clean and they had t.v.'s everywhere to watch the morning games...<br>- As for the service, it was good.  We liked how the waitstaff cleared our 'used' edamame plate frequently and filled our water glasses nonstop.  Our waiter did forget one of our items but hey, everyone forgets things once in a while.  <br>- Service was very good, the staff was very nice, and it turned out to be a good choice for dinner.  Yelp comes through yet again.<br>- All the dishes were brought out in a random order, separated on smaller plates and scattered across the table. It was a smorgasbord from heaven. The wait staff also made sure to take good care of guests with dietary restrictions. These were my favorites:<br>- Very good wait staff and they even got me to have some Loukoumades and I rolled out of there fat and happy.<br>- Fry's is a fun place to look around and a good place to easily get lost in. It's huge. It's like a Best By on steroids. But then it has oh so much more than Best Buy. It's got every kind of electronics. But it's also got things like Play-Doh and every item ever sold on TV late at night. Every item ever. Ever. And that is easily my favorite aisle. I can totally justify why I need each and every one of those items. The staff are nice. The checkout process is relatively smooth and easy. Whatever it is you need, Fry's probably has it. This is one store I truly enjoy joining by boyfriend in going to. He needs some random wire bolt thingy thing for some network computer thingy, and I get to wander aisle after aisle in endless amusement. Everyone wins.<br>- What a wonderful dining experience. The staff was excellent. The decor is beautiful. The spacious feeling of the dining area is pleasing. And now to the meal. The wor wonton soup was as good as any. I I eat the dish regularly has it just has all the goodies I like in it. The sizzling salmon plate was impressive not often I get sizzling salmon and it was cooked properly and tasted marvelous. Can't wait to come back and test some more of the wonderfully inviting items on the menu<br>- One of the best airport dining experiences I have hasd.  The only bad thing is that it is too easy to forget that you are in an airport, and thus loose track of time.  The restaurant is set back from the hub bub of the main airport traffic, and the seating is comfy, and the d챕cor is beautiful.  Plus, under the bar are electric outlets for you to power up your electronic devices while you wait.  The staff were friendly, and the server waiting on us at the bar was very knowledgeable.  The grilled vegetable open faced sandwich was incredible, and the bread was tasty.  The truffles were OK, nothing like Switzerland, but pretty good.  The local port was tasty.  They had a great wine selection, and even had some nice tasting flights of 3 glasses to choose from.  A highlight of the Charlotte Airport.<br>- It's located at the very end of Concourse C. It's a decent size Starbucks, with a good bit of seating. There seemed to be adequate staff - there were four people working, one was cleaning and space seemed to be very tight behind the counter. But the staff were friendly and conducted themselves in an outgoing fashion and with a sense of humor.<br>- I had not been here in about a year and most of the staff from then was long gone. The new manager (young shaved head) was very nice on this night, putting on the volume for the Jeter finale. The Hooters female bartender was prompt, but overall the staff wasn't as attractive as I recall in previous visits. They also removed the Beer of the Month special and it was 60 cent boneless wings night, but they make you get ten. They should let you get five and of course no dressing is included. They copied BWW exactly, no creativity. Well, the TV's are still great and the beer is still served icy and the mozzarella sticks at HH price were decent, so still a good place to catch a game.<br>- good sign).  The staff was super friendly, the service was efficient and the breakfast sandwiches were some of the best.  We enjoyed the Fairfax with avocado and the sausage, egg and cheese sandwich on brioche...so tasty!<br>- I've been to this location a few times to pick up steaks, lamb chops, and all sorts of sides to BBQ.  The staff is excellent and can steer you in the right direction if you're confused.  The prices are a bit high, though, and you're getting frozen meats.  I'd really prefer a good quality butcher shop, but unfortunately I haven't seen one in the area, so Omaha Steaks will have to do for the time being.<br>"},
    {"id": "atmosphere", "group" :4,"content":"- Sad to see so many average reviews.  I was so excited to see Chris Bianco opening another restaurant in Phoenix, so had to check it out.  The atmosphere is country rustic, the service was friendly and the food was quite good.  The spinach and swiss chard ravioli in brown butter was quite tasty!  <br>- Pretty good pub atmosphere, great chips and pretty good fish, especially for the desert.  My fish could best be described as a plank.  Three good size Cod fillets that were bonded together by the beer batter.  In the traditional English style, I prefer the Haddock fillets but you really only find that in England and New England.<br>- Started out with perhaps the best soup of my life (corn with lobster).  Then the caprese style salad was good but was hoping for more flavor from the tomatoes my cheese.  The filet was incredibly tender but lacking flavor. Finally the carrot cake dessert was delicious. Great atmosphere.<br>- We stopped in for happy hour one evening in August and had a good experience!  We enjoyed 1/2 price tacos and wine at the bar.  Friendly bartender, decent tacos and nice atmosphere.  I hear they are going to renovate the space and I think it definitely needs a facelift.  Excited to come back this winter and checkout the rooftop bar!<br>- Far exceeded my expectations...wow, good stuff.  I want to call this place the Chipotle of Indian food but that description completely dumbs it down.  The flavors are authentic Indian...it is so approachable for people who are new to Indian food and flavors (but not for this old goat...I have eaten seriously authentic Indian over the years).  There is a great sense of humor about this place from the naming of the chulah ovens to the copy on the napkins.  I ordered the chicken tikka, chickpea masala, Naan and a side of hot sauce with the side of mango sauce.  Deeee-licious.  And flavorful without being spicy.  If you think Indian food has to be blow-your-ears-off-spicy, eat here and debunk your own myth (or go eat at Taste of Kerala and actually have your ears blown off).  Are you as neurotic as me about what you eat?  Check the back of the menu for a complete list of nutrition information.  BOOM.  Not sure why BBQ is in the name...does not make sense to me.  Anyway...Brilliant concept, great atmosphere.  Save that last piece of Naan for me...pretty please?<br>- We finished of our night 3 out of our 4 nights in Montreal.  The dark forest green and warm wood colors created a warm atmosphere with a slightly more upscale crowd, and the best bartenders in Montreal.  Each night the same handsome bartender, whom shall remain unnamed, welcomed us with his lovely Quebecois accent and poured us some great cocktails and whiskeys.  On the first night, he gave us some free shots, and the following nights he gave us more freebies.   Despite us being obvious tourists, he genuinely seemed interested and socialized with us each night. He never tried to oversell us, and made some great recommendations on Canadian whiskeys that were delicious yet affordable(less than $10 serving).  The other good looking bartenders were friendly too. <br>- This place is lots of fun. The food is really good, as is the service. I really like the sliders here myself. They have a good sports bar atmosphere and show all the games on TV's all around the building. There is an outside patio off to the side. The beer selection is very good, and they rotate selections periodically. They have a full bar and wine available as well.<br>- This restaurant is absolutely ideal for any occasion where someone would like to impress their guest. Perfect for dates, taking the folks out to dinner, showing off to the boss or just sharing a dinner with a good friend, The House will really wow anyone who is looking for a quiet atmosphere with higher end food. Prices are absolutely worth what you pay and then some. I will never come back to Scottsdale without eating here!<br>"},
    {"id": "efficient", "group" :4,"content":"- It was worth the extra time.  I arrived at Five Guys at the time I had said I would pick up the burger and they were just finishing up.  The place was slammed and there must have been 12 employees behind the counter.  Even with all the people in the restaurant, there was no line and the employees were efficient and knew what they were doing.  There must have been some good pre-opening training!!<br>- Place was delicious! Staff is friendly and efficient and the location isn't too bad with it bing less than 2 miles from exiting the I-10. The sesame chicken was my favorite main dish. The carb rangoons don't look like they're tasty but they really are. The pot stickers were good, too. Orange chicken was average and the terayaki salmon was tasty.<br>- Walked in for a brisk dinner before our late flight back to NY. Waitress was friendly and efficient. The space was casually trendy. Slightly overprices but the pizzas are good and under $20. I went with Prosciutto (San Marzano Tomatoes, Goat Cheese, Mozzarella, Wild Arugula). <br>- Dennis is the man. Got a quote. Dennis came out the next day on time. Fast, efficient, friendly, and good price. I highly recommend these guys!!!<br>- good sign).  The staff was super friendly, the service was efficient and the breakfast sandwiches were some of the best.  We enjoyed the Fairfax with avocado and the sausage, egg and cheese sandwich on brioche...so tasty!<br>- The husband and I went to Modern Marg for a pre event happy hour. The bar itself is comfortable, with big cushy bar stools. The bartender was friendly and efficient, though his descriptions of the drinks were a little lacking (I asked which of the happy hour margs he would personally get and he replied ' uh, if you want agave nectar get this one... etc, not answering the question, just naming the ingredients, which I already knew). I had the Modern Margarita, which really tasted like tequila on ice. This was ok, especially for only 5$, but not the tastiest marg by any means. The husband had the Victoria beer on tap. The bartender was enthusiastic about this beer, so that was nice, and with good reason, because it was exceptional. We also had the salsa flight, which was very good and satisfying. The smoky salsa was tasty, almost like a bbq salsa, but the best of the three was the pico, which was just the right amount of spicy for a pico and tasted very fresh. The tomatillo salsa was lacking, not amazing. The salsas came with the largest basket of chips I have seen in a long time. We felt like we ate a full bag of chips, and the basket was still half full (yes, I am an optimist). This place is way out of my usual 'hood, so clearly it isn't a place I would frequent, but if they are in your 'hood, I would check them out for happy hour.<br>- Service was fairly friendly and efficient, and best of all, there's a reasonably extensive selection of craft brews here. I enjoyed a 90 Minute DIPA from Dogfish Head and a Dragon's Milk stout from New Holland. Solid booze and solid, reasonably expensive (for a major Strip hotel) bites - that's enough to keep me happy. Best of all, it was a good way to use some food credits that came with my room at the Bellagio and were valid across all MGM properties.<br>- It is located on the outside of the mall so parking and entering the store is more convenient if it's your only stop as it was mine. I purchased a pair of jeans and service was pleasant and efficient. When I decided to return them the very next day, the return was smooth and quick. Very good shopping experience.<br>- We met a friend here for brunch yesterday and had a good experience.  It was quite busy, but we only needed to wait about 5 minutes for our table of three.  Our server was friendly and efficiently took our orders.  I enjoyed the AZ omelette with egg whites, sausage, bell peppers, onions, cheddar and house potatoes.  Nice atmosphere, friendly service and good food.  <br>- I noticed there were a bunch of fun and unique vegan products for sale including some sweet treats that looked damn good.  Service was friendly and efficient (thanks Stevie).  I'll be back soon!<br>- Wow.... this place may have a translated name of Squash Blossom, but it is nothing like the old squash blossom... in a good way! They completely redecorated and it now has a Latin club feel. A friend and I wandered in here Saturday night after I saw their open sign through the long hallway and wondered to myself....why is that breakfast place open at 9pm? Anyway, we sat at the bar and it was kind of awesome. We met a couple at the bar that were a lot of fun and we all did many shots...We did some series of shots that included tequila, lime juice, clamato, and beer... very interesting! We also did esperma shots (because of the funny name) which were good, shots of fireball with rum chata (delicious), and we had some of their pina colada based drinks that were sweet and tasty. The bar tender was nice and the prices were affordable (shots = 4$, drinks = 6 ish?). The place is on the loud side and I believe they had a DJ. As it got later, the bar got busier but the service remained very efficient and friendly. I had a great time here and would definitely come back. <br>- The pizza is really good. Thin and simple. The slice kept well too. I only ate one for lunch and saved the other for later when I got home and it was still flavorful and tasty. Service was friendly and efficient. I was interested in some of their pastas. I will have to come by another time to check out their dinner specials or some of their lunch pasta specials.<br>"},
    {"id": "ambiance", "group" :4,"content":"- Great service, fresh tasty food, good drinks, romantic ambiance, live music in the back courtyard - we loved it all. Highly recommended over many other spots to eat at in the area, and I feel it's even better to come here without children at night if looking for a more romantic and adult kind of dining experience.<br>- First time at the Sunridge location but I've been to the McLeod Trail location too many times to count. So I knew what to expect food wise, ambiance, etc. but here we had a really good server which can be hit or miss for the Dubs. She was really on top of things and patient with the little kiddies we had with our group. <br>- I can depend on quality sashimi at Sushi Samba and yes you'll get the hip ambiance of Las Vegas with all the beautiful people working here and oh I forgot, the service is spot on. <br>- Taking the stairs down, I felt like I was going down to a wine cellar. It's such an old school, I felt like I was back in time. Apparently they haven't changed for over 40 years. I liked their classy ambiance. <br>- Desert and service was just average. I enjoyed the ambiance more than anything.<br>- As for the ambiance, it was a slow Sunday evening and we were one of maybe four tables seated within. Plenty of attention from our server without going overboard. It's a casual, yet chic environment. And yes, it's touristy, but I'd expect nothing less given the neighborhood.<br>- Upon entering, we were warmly greeted by the hostess. The restaurant is in the Venetian Hotel. I love the ambiance of this place, very chill. I felt like I was back in TN. Our server was attentive and kind. Everything we ordered from start to finish was on point. Definitely try their Fried Green Tomato BLT, awesome flavor combinations going on in that dish. If you're in Vegas and looking for some southern comfort food, this is definitely a great option.<br>- The Downstairs definitely has a very different ambiance than the Upstairs. Downstairs is open and has more of a sports bar feel in some ways. Whereas Upstairs is definitely an upscale restaurant atmosphere.<br>- This is a small neighborhood sandwich shop, but don't expect much ambiance.  The outside is hardly noticeable, located in a dying strip mall with a view of General Dynamics. <br>- I liked the decor and the ambiance. It wasn't too loud and not too crowded. The drinks were good, but a little pricey. <br>"},
    {"id": "attentive", "group" :4,"content":"- On my next visit, I went with my husband, and it was a Saturday night.  The place was beyond packed and the waitstaff beyond slammed, but still attentive and friendly.  Actually, Abraham was an incredible waiter, making suggestions upon request and chatting with us throughout the time we spent there.  However, the food was not quite as amazing as I remembered.  We had the Shrimp Tikka Masala, the Saag Spinach with Chicken, with naan and rice.  The Tikka was a bit too rich and buttery, and the Saag was lacking in flavor ironically.  It wasn't bad, but it wasn't what I talked it up to be.  I'm hoping it was just an off night as I do hope to return again!<br>- Could this buffet be any more decadent? Very clean, tons of options, nice staff. My faves were the VAST selection of delicious pizza, huge sushi area, and desserts (see pics!). The dining room is a little low brow but the wait staff was incredibly nice, attentive, and friendly. Would go back in a heartbeat.<br>-  So now on to the not so great parts... So first, we had tried to go to this restaurant for my birthday in April, but a couple days before our reservation, the BF got a call saying that chef Chris had fallen ill and that we would not be able to have dinner there BUT that they would call us as soon as he came back to give us a reservation then. Well, I waited a month after my birthday... no birthday dinner.... cuz all I wanted was to go here. No call. The BF called and left several messages with no response. Then the message changed and they were closed for the summer and we went somewhere else. That was pretty bad. So now we got a res for our anniversary, and I was super excited but things went so wrong. The main dish was not at all impressive. I was told that one entree was chicken in a creamy sauce with black rice and spinach and I ordered that. The BF got a beef tenderloin with pesto, potato, and spinach. Well... they came out and my chicken and his steak were identical...both with pesto, spinach, grilled potato. That irked me a little bit, but I just figured that it was an honest mistake on the waiter's part. Then I took a bite of chicken and it had a gelatinous texture... I have never experienced that before, but I thought maybe it was just so juicy and I have never had chicken prepared in the same way before...Wrong. Then I took another bite and the texture was just weird. I tried to see if it was pink inside, but we only had the candlelight so I couldn't tell. Had the BF try it, and he said he thought it was underdone. Not a real awesome thing for chicken. So I sent it back and the waitress was very nice, apologized and took it. Chef Chris brought the new one out a few minutes later and was very sweet about it, which I appreciated. However, the chicken was not so awesome. Maybe I was just turned off to it or something... but it wasn't very appetizing. Anyway, it was kind of bland and the sides were not great... plain potatoes and raw spinach and tomato.... nothing special, and definitely nothing worth the price. The BF's steak was chewy but still better than the chicken, but essentially they tasted the same. The worst part, though, was unfortunately the service. I would understand the service being lackluster if chef Chris were doing it all himself, but with two people on waitstaff and only about 15 tables it was unacceptable. We were there for 2.5 hours, which would be fine if that was the intent of the restaurant..but I don't think it was. The first two courses were timely, but dessert was kind of a mess. We got some coffee...cute LARGE coffee cups, but not too much coffee in them and it wasn't hot, but it was tasty. We finished the coffee before we got our dessert. The waiter told us he'd bring some more coffee (us and the people next to us too) he came back a minimum of 3 times without refilling our coffee, probably more. I don't know if it was because there was a big table inside to tend to, but we did not get coffee until about 10 minutes after we finished our dessert and I had eaten slowly on purpose because I wanted to have coffee with dessert. THEN we proceeded to get the wrong check twice (with about ten minutes in between wrong checks) and wait about 35 minutes to get the correct check. There was some confusion between the waiter and waitress on who was supposed to take care of us, but it was a bit ridiculous. For 100$ for two people there are many places that have attentive service and tastier food. So for all of these reasons, I do not foresee us returning to this restaurant in the near future, unfortunately, because there really are some great aspects of this place<br>- Prices are wonderful. The menu intriguing.  The interior clean and neat. The staff friendly and attentive.  The food excellent and fresh.<br>"},
    {"id": "friendly", "group" :4,"content":"- Conveniently located within steps of the airport terminal, this subway station was apparently the first in the country that connected an airport to a major city centre, and these days it continues to do so in efficient fashion. To the extent that there are staffers here helping befuddled visitors with ticket machines, they're incredibly helpful and friendly, and besides that it's a simple, super-quick hop-on, hop-off ride to downtown and the University Circle area. Gets the job done smoothly and efficiently.<br>- Phenomenal practice!  Dr Wellish is absolutely top-notch, the staff is incredible and friendly, and I love Heidy -- who does all the extra level of service and follow-up.  When i was diagnosed with cataracts in both eyes at an unusually young age, I was amazed at the expertise and knowledge, choices and recommendations, and terrific  care.  The office seems also to run very efficiently.<br>- I really enjoyed this little gem.  Great beer and great food in a great atmosphere.  Very friendly, helpful, and knowledgeable staff.  None of the food here has ever disappointed.  I especially love the mac 'n' cheese.<br>- The staff were incredibly nice and friendly. They took the time to truly listen to what I wanted. And they emphasized that anything I wasn't happy with, they wanted to know about it and would note it for next time. They also emphasized that they have several different groomers - each with their own style - and I was welcome to request a different groomer next time if I so wanted (or request the same groomer). <br>- I like this Wendy's. The food is made to order and taste like Wendy's should. The staff is friendly and efficient. Drive through moves fast.<br>- But it was the staff that did it for me.  Diana behind the bar, and Ashley too, were very friendly.  When I didn't order a drink I didn't get the ol' bartender eye roll.  And when her POS locked up when I tried to pay, Diana apologized profusely and even brought me some truffles for my wait.  Totally unnecessary, but it show you that management has the staff put customers first here.<br>- On my next visit, I went with my husband, and it was a Saturday night.  The place was beyond packed and the waitstaff beyond slammed, but still attentive and friendly.  Actually, Abraham was an incredible waiter, making suggestions upon request and chatting with us throughout the time we spent there.  However, the food was not quite as amazing as I remembered.  We had the Shrimp Tikka Masala, the Saag Spinach with Chicken, with naan and rice.  The Tikka was a bit too rich and buttery, and the Saag was lacking in flavor ironically.  It wasn't bad, but it wasn't what I talked it up to be.  I'm hoping it was just an off night as I do hope to return again!<br>- I don't typically do much of the shopping in our household, but I have to say that Kohl's isn't a bad choice. The staff there is friendly, and the selection isn't horrible. they also offer some pretty solid coupons just about year-round, so keep your eyes out for them.<br>- The hotel staff was very friendly and helpful. <br>- The staff here is friendly and the lines are short most of the time.<br>"},
    {"id": "helpful", "group" :4,"content":"- Conveniently located within steps of the airport terminal, this subway station was apparently the first in the country that connected an airport to a major city centre, and these days it continues to do so in efficient fashion. To the extent that there are staffers here helping befuddled visitors with ticket machines, they're incredibly helpful and friendly, and besides that it's a simple, super-quick hop-on, hop-off ride to downtown and the University Circle area. Gets the job done smoothly and efficiently.<br>- The staff here is on-point. Everyone I encountered were more than helpful and highly courteous. Our room was nicely appointed and they even had a special menu printed up for our company event which added a personal touch. <br>- I really enjoyed this little gem.  Great beer and great food in a great atmosphere.  Very friendly, helpful, and knowledgeable staff.  None of the food here has ever disappointed.  I especially love the mac 'n' cheese.<br>- Chances of returning to this Oakley Vault location at the Las Vegas North Premium Outlets are very high.  Shop is clean and well organized.  Most of the staff was polite and helpful as well.<br>- The hotel staff was very friendly and helpful. <br>- The menu lists which desserts are healthier and which are more indulgent, which is helpful as they all look amazing. The strawberry-rhubarb macaron (healthy side) was a delight, but the Exotic Fruits (combining coconut, passion fruit, and matcha) recommended by the staff was even better, reminding me of Yonaka's desserts with the beautiful plating and Japanese flavor influence. <br>- The front desk staff was very friendly and efficient.  Housekeeping staff were nice.  The staff in the executive lounge was a little cold and not particularly helpful.  <br>- The staff here are usually pretty cool and helpful.....plenty of parking in the lot and KO's is next door (restaurant/bar)....what more could you ask for?!<br>- I can't recall a bad experience at any Lowe's I've been to. Wide aisles, well stocked and organized shelves, helpful and knowledgeable staff, reasonable prices. And they have a free wifi network. Love it.<br>- The store is catered more towards online orders so there is not much of a showroom, but the staff here are friendly and helpful. You can buy various accessories for your car here, from decorative adhesive emblems to seat belts. Although most of their inventory focuses on the particular make of your car, they do sell some novelty accessories such as the DC emblem I bought. <br>- My stay at the Venetian was a brief whirlwind but it was great none the less. The room was spacious. The bathroom was gorgeous. Vegas was getting off to a good start. I got to know the Venetian very well over the next few days as the seminar I was in town for was going down in the Sands Expo. The staff I encountered at every turn were always the most helpful. <br>"},
    {"id": "polite", "group" :4,"content":"- Chances of returning to this Oakley Vault location at the Las Vegas North Premium Outlets are very high.  Shop is clean and well organized.  Most of the staff was polite and helpful as well.<br>- When I arrived here to have my car viewed it was quite the easy task.  My wait was minimal, the staff were polite and I wasn't being jerked around.  Within five minutes of them looking at my car, I was out the door and heading back to my place.  <br>- The staff is super friendly and graciously polite and, though not all that knowledgeable, know their way around. <br>- Service is polite and food comes out fast. They have the door bell style buttons to summon the waitstaff to your table, which I don't typically like, but they're usually attentive enough that I don't have to use it. Location is small but clean and nicely decorated, they usually get pretty busy for lunch!<br>- There's a special place in hell reserved for those leaving a new business 1-star reviews for typical opening kinks. Service was polite but given that they were busy for opening weekend (expected), orders were a bit slow to come out but wait times were not unreasonable. Things will likely get quicker as the staff get more familiar and the hype dies down a bit. I'll be back to get my sip on this summer!<br>- I'm happy that we didn't walk past this shop because the samosas were so delicious and you can't beat a dollar per samosa. The staff here was very polite and they quickly bagged our food before we continued our journey. <br>- The staff here are friendly, attentive and polite. I would leave that to my Yelp friend to comment on that as I was busy drinking my sake and trying to take some photos of my food.<br>- The food is clearly made fresh and throughout the day.  There isn't a line to get your food, per se, as there are various stations to walk up to.  Some have chefs to serve you and others are self-serve.  The staff that clear your plates and provide beverages are fast and not always   friendly but they are polite.<br>- Very Pleasant Receptionist!!!  Everyone here is always polite (staff) one of the Artists was friendly.  The Receptionist today was a 6 yelp stars friendly and helpful!<br>- Very cute store with adorable gifts for babies and kids. I didn't buy anything, but I'll be back! Very polite staff too<br>- Wow, this place is impressive.  The library is 2 city blocks long.  The business library is one of the top in the country.  And the selection of movies is large, too.  Perhaps most impressive is the staff.  I must have worked with 4 different people and all of them were polite, patient, friendly and very helpful.  A library card gives you access to Clevnet, an online system of a card catalog and searchable database of movies, books, etc.  You can also put a hold on books and DVDs.  You will receive a letter in the mail when your items are available for pickup.  How cool is that?  Aside from the Metroparks, this is another hidden gem in Cleveland.<br>- The staff was really nice (those polite Canadians) and the boat ride was quick. People in the know ran for the seats in the front so I followed along. Wow it was chilly out on the open water.<br>- As the other ladies have mentioned, this is a large nail salon with plenty 'o pedicure chairs (that also massage your back too!), a manicure bar and some extra space for facials and waxing. There are plenty 'o polishes (OPI, Essie) for the picking and they even sell a nice variety of them, too. They always have the new color releases and the prices start around $8-$9 per polish. The staff is accommodating and polite and I certainly appreciate the complimentary wine and/or beer while I'm getting polished. <br>- This location has a tendency for sketchy outside and often inside sketchy characters. Overall the staff has been polite. The food is always the same.<br>- The service is excellent! The waitstaff are so polite and considerate! <br>"},
    {"id": "knowledgeable", "group" :4,"content":"- I really enjoyed this little gem.  Great beer and great food in a great atmosphere.  Very friendly, helpful, and knowledgeable staff.  None of the food here has ever disappointed.  I especially love the mac 'n' cheese.<br>- One of the best airport dining experiences I have hasd.  The only bad thing is that it is too easy to forget that you are in an airport, and thus loose track of time.  The restaurant is set back from the hub bub of the main airport traffic, and the seating is comfy, and the d챕cor is beautiful.  Plus, under the bar are electric outlets for you to power up your electronic devices while you wait.  The staff were friendly, and the server waiting on us at the bar was very knowledgeable.  The grilled vegetable open faced sandwich was incredible, and the bread was tasty.  The truffles were OK, nothing like Switzerland, but pretty good.  The local port was tasty.  They had a great wine selection, and even had some nice tasting flights of 3 glasses to choose from.  A highlight of the Charlotte Airport.<br>- The staffs are friendly, knowledgeable and patient.<br>- I can't recall a bad experience at any Lowe's I've been to. Wide aisles, well stocked and organized shelves, helpful and knowledgeable staff, reasonable prices. And they have a free wifi network. Love it.<br>- The staff are easy to approach and very knowledgeable about the products they have for purchase here.  I was intrigued by the wood earrings they had for gaged ears.  Time definitely could be lost while browsing through this store.  Before we knew it the sun was starting to set outside.<br>- The staff is super friendly and graciously polite and, though not all that knowledgeable, know their way around. <br>- Oh how I love pizza and this place was just great!  The space is cozy and really comfortable, the staff is amazing - we had the opportunity to talk to the super friendly and knowledgeable owner - and the pizza ranks up there as some of the best in Phoenix.  If you like hand crafted pizza, definitely check this place out!<br>- Wine - There is a good selection of wine to choose from and all of the staff are knowledgeable and can help you find one that suits your taste.<br>- I didn't get a chance to check out the back of the store much because having a 3 month old puppy wrapping himself around your leg fifty times doesn't make for walking through the store a fun task.  We (yes we, Eli, little man) browsed through the toys and treats up front.  While we were browsing the staff was very friendly, knowledgeable and on top of their game.  They have a lot of environmentally friendly toys for your pets located there.  Picked up a chew toy made from wool for Eli and he has not let that thing alone since we came home.<br>- Really knowledgeable staff and ready to help. They won't steer you down the wrong path just to make a few extra bucks, they'll set you up with what you need and nothing more. No sales pressure.<br>- The staffs are just so knowledgeable with every aspect of the menu and wine list... This is one of the time I enjoyed listening to my waiter goes on and on about the ingredients and the preparation of each dish... (the accent yes!!)<br>- The Humane Society has been my go to place for pet adoption over the years. I got both of my cats from the Humane Society, and they both are wonderful. I like that they provide a vet visit and a bag of quality food with adoption. Additionally, I like that their volunteers/staff are friendly and have seemed to be knowledgeable and the animals are kept in individual small cages or in large enclosures with 2-3 animals. The cats I have adopted have been wonderful, in good health, and seem to have been taken care of in their (extensive) time at the Humane Society. Both cats were lonely hearts (had been in the shelter for months) and had nominal adoption fees (5$ and 20$... wow). Both had been spayed and received medical attention. When it is time to adopt another furry friend, this will definitely be the place to go.<br>- Thanks REI! Couldn't have done this without your knowledgeable staff.<br>- They have knowledgeable staff members who will help you along the way. For instance, if you enter via the side doors, you will be ushered to the monitors inside the mall area to check out what is available -- that is, if you don't already know what you want to see. Then, you get in line and someone will come over and ask you which show you're wanting to see and then get you to the correct person to help you purchase your tickets.<br>- They also sell wine! They've got a wine expert on site to help you with your selections. The staff is also quite knowledgeable about their beers as well. Since I was an out-of-towner, they were able to steer me to the best local beers, made just down the street. <br>"},
    {"id": "professional", "group" :4, "content":"- A word about the service--it was as good as it gets.  The servers were attentive, professional, and friendly.   Dishes were promptly removed when a course was finished.  When my server came to check on me during the main course, he said he'd have another iced tea brought.  As he said that, we both saw one of the staff bringing me a fresh glass.  They didn't refill, they replaced with a full, new glass.  They were very impressive with their service.  <br><br>- We arrived a few minutes before our reservation time and were promptly seated and drink orders were taken as our group arrived in small groups a few minutes apart.The restaurant provided us with two assigned servers who were very proficient and other members of the staff joined in as needed to help serve the drinks and keep the bread and olive oil fully stocked on all the tables. The entire staff was very professional and outgoing and provide us with the best possible service the entire evening.<br><br>- Seeing a few new faces amongst the service staff, everyone professional yet fun as in the past, it was with a welcoming from Chef Smith that the meal got started and eschewing menus in favor of a carte blanche offering the first course of Summer Melons with French Ham and whipped Goat Cheese was a refreshing way to start the evening, the flavors of a Nicoise Salad next cleverly presented by way of acid-kissed Tuna beneath Olives and a Quail-Egg atop a piece of Toast.<br><br>- Evening started with a drink service in the bar area and the waitstaff were all attentive and professional.<br><br>"},
    {"id": "deco", "group" :4,"content":"-  This shop is very close to my apartment, walkable for me. The coffee is really good. It is from a local roaster in Tempe. Additionally, the people who work there know a lot about coffee. The guy with the darker hair who works there is very interesting and has worked in the coffee business for several years. The owners are hard working and great at making delicious lattes. Everyone is friendly. Additionally, the decor is super cute and the furniture is comfortable. I have never had a bad experience here.<br>- I have a problem. A serious dessert addiction problem. And Pop N Tea is not helping. At all. This place opened around the corner from my house about a month ago and I've gone 3 times since because I am sick. Their tea is so good, and I don't even typically drink much tea..... Their Boba is insane... It's bright green and the perfect texture, not too chewy, not too firm. My real issue though is the diamond bars. 3d printed Gelato in all different flavors shining like gems in the case, waiting to be enrobed in dark chocolate (or white or milk) and adorned with coconut or nuts or oreos...... These puppies cost 6$, which is super high, and yet I continually go back for them. This place is pushing their 'instagramability' hard.... Very cute decor, just begging to be photographed. Many people go with the half dip on their ice cream for aesthetics, but I just cannot agree with sacrificing more chocolate for a pretty picture....bring on the full dip guys! Check this place out, you will not regret it.<br>- It was awesome that my stay was during Chinese New Year/Tet/Sol Nal, because there were so many beautiful gardens and decorations celebrating the year of the lamb/goat.  With that, more than 50% of the gambling tables were filled with people celebrating the Lunar New Year and hoping for good luck.  There were some people even praying to the goat statues and fountains.  Also, there were many open Asian restaurants in the hotel serving, to my surprise, authentic style Hong Kong, Vietnamese, and Chinese dishes.  While the hotel restaurants are waaaaaay more expensive than they should be, the food was great quality and the service outstanding.<br>- What a wonderful dining experience. The staff was excellent. The decor is beautiful. The spacious feeling of the dining area is pleasing. And now to the meal. The wor wonton soup was as good as any. I I eat the dish regularly has it just has all the goodies I like in it. The sizzling salmon plate was impressive not often I get sizzling salmon and it was cooked properly and tasted marvelous. Can't wait to come back and test some more of the wonderfully inviting items on the menu<br>- When Gabi K suggested we stop at Pita Jungle for a bite to eat after a Yelp event I had images of Rainforest Cafe in my head.  I think it's the jungle part of their name that led me to that vision.  But when we arrived at Pita Jungle I didn't see any over the top jungle decorations, loud fake animals, or screaming children (phew).  Instead Pita Jungle is a lowkey spot to get some good Mediterranean food.<br>"},
    {"id": "environment", "group" :4,"content":"- Review: I was trying to decide between two and three stars because we went here for our fancy anniversary dinner and I really REALLY wanted to love this place! Unfortunately, it was disappointing. I'll start with the positive stuff, because there were lots of positives- 1. Chef Chris was super nice and friendly 2. I love the environment, we sat on the patio and it was beautiful. The tables were candlelit, there was a pretty fountain, and I LOVED the little wood burning fireplaces and the nice smell that the wood gave off 3. A lot of the food was good. We started with a very tasty minestrone soup with home made crackers and the dessert (pumpkin cheesecake) was also wonderful! I also liked that they put mint in the water and the coffee was very good.<br>- Most of the restaurants here are reasonably priced and being in such a competitive environment, all of them have to be excellent and good value if not they won't be in business for long...... the turnover of business here is so fast and frequent!!<br>- Generally blas챕 as it relates to Mediterranean cuisine but always hopeful for something to change my mind it was with guarded expectations that I sat down with a friend at Cleo, and although both the room and the crowd veer trendy and loud the food can best be described as bold - each of the eleven plates we experienced featuring textbook execution, beautiful presentation, and the sort of flavor profile rarely embraced in an upscale environment.  Located inside the SLS, under the gleaming guise of the Greek Pharaoh and Starck designed through-and-through, our 6:30 seating started with pleasant greetings at the podium and quickly swept away to a small two-top flanking an open kitchen the service could not have been better, drinks kept brimming throughout the evening and plates arriving in a slow, measured fashion - exactly as requested.  Beset by tagines and spice jars juxtaposing slick surfaces and sparkling chandeliers beneath a lively soundtrack that only rarely interrupted conversation our meal began with a quartet of $7 'mezzes' and with both spreads silky smooth and teaming with flavor atop pillows of Laffa the Kibbeh and creamy spinach puffs were no less special, the former balancing ground lamb to nuts and spice beneath a golden shell.  Moving next to larger plates under simplified headings like Vegetables and Meats it was with some disappointment that we were informed the coveted Duck Bastilla was unavailable but making due with four more items both the elegantly paired mushrooms and equally well conceived tagine were quite good while the still-bubbling moussakah was my favorite plate of the night.  A touch underwhelmed by crispy balls of falafel that had trouble standing up to the sauce in which they sat it was in flatbread that our savories finished and with a crisp, charred crust from the central oven likely to make any topping taste better the bitter kale amidst pools of tangy cr챔me fraiche was wonderful, an elegant and light dish I could see playing well to the pre-club crowd heading to LiFE.  At this point approaching nine o'clock, with every seat in the space filled, our meal concluded with coffee alongside a duo of desserts and as much I liked the somewhat out-of-place pudding it was the pannacotta that stole the show - each creamy bite flooding the palate with milky-sweet tones while Amareto soaking the figs lingered at the end.<br>- As suggested, we got the scorpion bowl. IT WAS HUGE. HUGE I SAY! By the time we left, we were really full between having just eaten, and having drank about a gallon of booze. Service was good, it was a chill environment, and you can smoke inside. What more could I ask for? <br>- The environment here is pretty good to study in. The students I saw here from across the street were focused on their books, and no real distractions were found here. This is great, as it is hard finding a coffee shop with the same qualities in LA.<br>"},
    {"id": "interior", "group" :4,"content":"- With the seated area outdoors, I was enticed to eat outdoors that day.  I was about to leave back to Chicago on this day, but thought it would be nice to get some healthy food and check out a new spot.  The interior is pretty open and functions without the need for a waitress, but not like a fast food joint.  They have quite an extensive menu for a healthy food spot.  I thought it might even be just vegetarian, but it's not.  My coffee wasn't very good because I had her add in the fat free caramel syrup, so that was my own fault.  So many things sounded good here, and I ended up choosing the steak and egg scramble.  It was a pretty nice portion and tasty.  I could totally see myself coming here after a good workout or something and feel good about myself after choosing anything to eat here.  The prices are decent, and the service was alright.<br>- The donuts were excellent. I tried a cake donut with maple frosting. The cake was a perfect texture, not too dense, slightly pillowy light. It was a good amount of sweetness and the maple glaze was just the right amount. There was a slight crispness around the edges to contrast with the softness of the interior. A cinnamon sugar twist I had was very fresh and soft.<br>- ***This is a nice library inside-and-out; the exterior design is good and I really like the interior (it has a great classical and historical look, but they have also done a really good job updating this library to make it contemporary and comfortable); their collection is also good though the central public library in Downtown Los Angeles is more impressive***<br>- We ate dinner there today and we loved everything about it.  The food was *delicious* (my husband had the broiled cod entree and I had the roasted spinach salad.  His came with seasoned home fries & steamed broccoli and mine included eggplant, quinoa & mozzarella cheese.  The vinaigrette dressing was particularly good, too).  The prices were *very* reasonable, the portions were generous, our server was super-friendly, the manager was very pleasant (I complimented him afterwards), we liked the interior and the restrooms were very clean.  A great experience in every way!<br>- We picked out what we wanted and took it to a large dining room type table with some fresh flowers for their grand opening.  I got a macaron that was filled with gif and goat cheese.  What a wonderful combination!  Light crisp outside shell and a smooth interior.  I also got a box of 6 macarons to bring home--maple bacon, s'mores, pumpkin, and Nutella.  I can't remember the other two but they look great and based on the one I ate last night, they will be good!!  The macarons are about 3 inches in diameter--more like the ones at Bouchon than other bakeries that sell them.<br>"},
    {"id": "pricing", "group" :5,"content":"- ***1/2 Thus far making a big error at launch in terms of pricing and still not up-to-speed with service it will be interesting to see how Canter's at Tivoli Village evolves with time, the property already notorious for shuttering several restaurants not really a place where starting off on a bad foot seems well advised but the food, at least what was tasted, so far good enough that it can hopefully keep the place afloat as they work the kinks out.<br>- If you have a smart phone, you can check www.Amazon.com for pricing, just to compare. For the most part, the prices are pretty good. We found a baby swing by Fisher Price for under $50, the same one on Amazon was $75. <br>- The prices are about three bucks lower at this location than other AMC theaters. I believe we paid $6.99 each for a night movie and a matinee would only be five bucks. The place was pretty empty on a recent weeknight and that was good, but no fresh popcorn was sighted, so we had to pass on that treat. Everything else was pretty good once inside including the reclining seats. Must be college pricing here in Tempe, but anybody can partake in the bargain deals.<br>- We ordered a ridiculous amount of food- dumplings for days, several types of shumai, rice noodle, stuffed eggplant and peppers, pork buns, egg tarts, and even fried smelt, which I haven't seen many places in town. The food was served as ready, hot and fresh, and was well made. I really liked their house-made chili oil on the table, which I added to almost everything. The staff were good about keeping up with our orders and drinks, and were able to provide suggestions for a couple ladies with dietary restrictions. Also, the pricing was great: under $20/pp including tax and tip (mandatory group rate) for a huge amount of food. <br>- On to the food. Solid as always. Not the best sushi in town (that goes to Goyemon in my book), but definitely good and with the option of happy hour or AYCE pricing, it's actually quite a bargain. I like having the option of AYCE when I'm feeling gluttonous or to go a la carte with the discounted rolls and nigiri if it suits my mood.<br>- Michelle is awesome.  She skillfully applies extensions to each lash, using Mynkies lashes. She uses a strong glue so the lashes have staying power.  Compared to other lash extensions I have gotten in the past, the Mynkies are the best.  Her pricing is very good, and it is easy to book online.  I just wish she would wear gloves.<br>"},
    {"id": "cheap", "group" :6,"content":"- Not only have my clothes always come out perfect, but the pricing is insane - insanely cheap. I literally pay about half of what I have paid at other dry cleaners.<br>- I went here today thanks to the suggestion by Brian F. after asking for places that offer do-it-yourself dog washing. I've been looking for a place that I can wash my dog and this was the perfect place. They offer shampoos, conditions, doggie cologne, towels and dryers that look like car vacuums. We were in and out within 20 minutes and my Linky was no longer stinky! I also left for a new found respect for dog groomers b/c my pup didn't want to cooperate with me at all. They offer regular grooming as well and when I asked what pricing was for my small dog, I was astounded at how cheap they are compared to other places in Charlotte I've been to--about $10-$15 less. They explained that you can drop your dog off and they let them play with the other dogs for a bit then groom then so it's not a quick process but nothing that takes the entire day either. This will definitely be my next stop when I need to de-stink my dog or get him groomed! A little obscure location north of the Park and Woodlawn intersection, they are behind a dry cleaners and have a parking in the rear sign on the side of the building. Parking can be a bit tight.<br>- Our total was about $25.  I thought pricing was very cheap and reasonable.  The bowls all run about $11 each and any additional add-ons, such as corn, is another $1.  The service was excellent.  The girl waiting on us was very bubbly, sweet, and knowledgeable.  The food came out fast.  The inside of the restaurant is small but cute.  It has an urban vibe, which I like.  Overall, it's a solid ramen house that I would come back to.<br>- I found the pricing to be fair not cheap by any means but comparable to the pricing online and since the sizes are very brand specific I think it was the right choice to have her to be able to try on these before purchasing.<br>- You can throw a rock and hit a supplement store in this town, but most of them don't have the great pricing and selection as VDN! I'm that person, whipping out my cell phone and price checking everything, and it's actually pretty rare to find anything cheaper even on Amazon.<br>- Greeted immediately upon entering. Large scale home rugs were on the front left side, along with upholstery fabrics too- middle front of the store- many patterns, about six according to general color scheme were in one given area; there were many of these combinations. A very small section with $1.50 yard fabrics, some of these would make a good dress lining- about 8 bolts, were there- caught my eye, but I wanted to check out the rest of the store. The clearance section (bolts were standing in the racks) was in the back, left side of the store. ALL SALES FINAL. The price tag had two prices on it, the one with the YOUR PRICE is the one to focus on. Yes, those fabrics were very affordable. We were very interested in a bolt with the sticker covered over, so of course, we had to ask for assistance. We decided to get it, so he took it to the front cutting counters. It ended up being $4.00 a yard, so we got a couple yards for covering up our animal print ottoman (doesn't match with our beach theme). Otherwise, the general pricing was $14.99 a yard (mostly cotton fabrics btw). So many pretty fabrics, so many possibilities. Near the cutting counters, were decorator throw pillows for $9.99 located in in metal bins. Along the wall, right side of the store, were assorted trims and tassels, etc. Some trims were as low as 99 cents a yard, some tassels (final sale) were priced at 50 cents each (so very cheap!). I also spotted zippers, but couldn't find the price tags. <br>"},
    {"id": "reasonable", "group" :6,"content":"- We ordered a bunch of dishes on the HH menu to share. The portions are relatively small, but the prices are reasonable compared to the other sushi restaurants on the strip. The flavors are creative, presentation was nice, service was fast and efficient. We probably ordered one of each item on the pretty extensive HH menu, and enjoyed every dish. Drinks were pretty tasty also.<br>- The food was exactly what you want from a diner, the service was very nice, and the pricing was more than reasonable. Can't wait to return, they have a huge seafood platter I've gotta try. Might even try Dale's favorite - a sliced tomato sandwich with Miracle Whip, salt & pepper, on regular sliced, white bread.<br>- This is a great Nordy's. Not huge and doesn't compare with the Seattle or Bellevue stores, but respectable. The men's dept has a reasonable selection and a great Canali area. Service is great but hard to find. <br>- We are big fans of sushi at Little Buddha (Palms) so it took a lot for us to try Social House.  We wanted to sit outside and this is one of the few sushi places with outdoor seating.  The atmosphere of this place is incredible.  It's very chic, modern, hip, and plays great music.  The outdoor patio overlooking the strip and Venetian (and pirate show) is spectacular.  Social House probably serves THE best spicy tuna rolls I have ever had.  The toasted sesame seeds inside the rolls were a nice touch and the tuna was uber fresh.  The salmon and cream cheese roll was dee-lish as well.  We tried the adobo chicken roll (one of their house rolls) and sent it back.  I guess warm chicken threw us off and we didn't like the taste of it.  In fact, it was weird.  Prices were reasonable and they had a great wine list.  We will definitely go back the next time we are in Vegas.<br>- ***Avenue B's kitchen turns fresh and high quality ingredients into light dishes that are also flavorful, vibrant and filling; their reasonable lunch prices also make Avenue B a great option for an upscale lunch in Pittsburgh***<br>- Prices for lunch were reasonable.  Most of the entrees were in the $12-$15 range and several of the starters were $8 and below.<br>- Avenue B is a very impressive restaurant that showcases fresh ingredients in satisfying flavor combinations.  There is also a lot of talent in the kitchen as the flatbread and salmon were both perfectly to near perfectly prepared.  All these great things plus Avenue B's reasonable lunch prices make it a great choice for a delicious upscale lunch in Pittsburgh.<br>- Not cheap, but I did have the advantage of a strong US dollar that made it reasonable.<br>- Yummy lunch here at this new Establishment. Plenty of parking in the private lot and prices here are reasonable.<br>- For food court fare, this is quite good Greek food.  The sandwich is made from fresh ingredients save for the pre-cooked beef and chicken which are heated on a grill before constructing the sandwich.  The price for the meal is reasonable.<br>- A nice place for happy hour!  After watching a lovely show at The Orpheum, we were feeling quite peckish, so we headed over to partake in the discounted delectables that The Arrogant Butcher had to offer.  I also just wanted to eat here because I dig the name Arrogant Butcher. From 3-6 PM they offer appetizers such as pretzels with cheese fondue ($5), fried shrimp with shishito peppers ($8), and artichoke hummus ($8).  They also have a decent selection of mixed drinks, wine, and beer at a reasonable price for happy hour.  We indulged in all the appetizers described above, and left with full and satisfied stomachs.<br>- While some may think Bradley Ogden is too expensive, we thought prices were reasonable but then again, we're used to SF<br>"},
    {"id": "inflated", "group" :6,"content":"- You'll see people throwing the football around in the back on the astroturf, some hanging out drinking a few beers and others taking shots at the bar. The crowd definitely varies, and that's a good thing, I think. Prices are slightly inflated for drinks, but there are not even close to the massive markup in the stadium. I believe everything is cash only and there are a few mini ATMs there just waiting to take your $4 of convenience charges. <br>- All real men isn't it a requirement to love a junkyard? I'm like a kid in the candy store. From the car side to the truck side they will most likely have what your looking for. And the prices are cheap obviously. Who wants to hit up the dealer and pay inflated prices when you can grab you're tools and get dirty finding the parts you need and sometimes don't need lol. They also sell complete cars now. Its 1.00 to get in. They accept plastic now incase you don't carry cash. <br>- But the traffic! The inflated pricing! The traffic! The smoky, run down casinos, tacky street performers,  scammy dudes trying to hand you escort cards, and homeless people everywhere without resources to get real help! And did I mention the traffic? But when I get frustrated with any of these things I just have to spend a minute wondering what Vegas might look like without the glitz, glamor, and tourist monies generated by the Strip.<br>- I admit that my rating miiiiight be inflated because we ate here after a loooong day in Sedona and a rather big hike and I was ravenous!<br>- I was happy to see that this was an affordable option in the otherwise inflated price bubble that is Vegas--and it is managed by a renowned chef to boot.<br>- It's the closet thing to the mall that you will get on the strip, at inflated prices. Personally other than FAO I've never actually bought anything, just browsed. It is a good way to kill time, look at expensive stores and admire the decor inside the mall. For the most part, the store are no different than the ones we have in Vancouver. I enjoy the feeling that you're outside instead of in a mall (faux cloud roof). It is actually a big mall worth checking out, just not strip shops.<br>- This is the company we rented the car from this trip.  We flew in to Phoenix, rented the car, drove to Tucson, then back to Sky Harbor to pick up my brother Jim and then drove together to Sedona.  It took an unusually long time for Alan to get the car, between waiting for the few people in front of him to be served and then listening to the usual rental car upselling to get ours.  The car was a 2012 red Mazda 6 and it was clean, comfortable and in good shape, if relatively high mileage (about 34K miles).  The only problem we had along the way was when a tire pressure light came on in Sedona.  Alan had it looked at by the guy at the auto shop near Tortas de Fuego.  One tire was overinflated and another was underinflated.  That was easily remedied.  Returning the car was easy and uncomplicated, although the guy to whom we returned it was clearly not interested in hearing about the tire pressure issue.  The price was reasonable, more importantly, the car was reliable and comfortable and we would deal w/ Advantage again.<br>"},
    {"id": "quality", "group" :6,"content":"- I tried Fleur a few years ago and for the most part the food was good (with some just okay dishes here and there).  Despite the quality of the food, the portions were incredibly dainty making Fleur feel quite overpriced.<br>- Service here was great, food was overall good quality and yummy.  I thought the seafood (panang curry) was overpriced and under quantitied with 3 shrimp and 3 large scallops and steamed rice for *drum roll* $16.95.<br>- The food is, well, airport quality food. This may bear the Wolfgang Puck name, it's no Spago or anything. And the food is definitely overpriced for the subpar quality. But it is edible.<br>- Folks looking for a different eating experience will certainly find it at Sinatra (http://www.yelp.com/biz/sinatra-las-vegas) and the same goes for the clubby yet foodie ambiance of Andrea's (http://www.yelp.com/biz/andreas-las-vegas). Wazuzu (http://www.yelp.com/biz/wazuzu-las-vegas) is kind of like an overpriced Asian fusion diner, which is totally skippable in the Encore experience. I personally enjoy every meal at Society Cafe Encore (http://www.yelp.com/biz/society-cafe-encore-las-vegas-5) but that's just me. The line up of eateries may not be impressive compared to its casino counterparts, but at least the places featured are quality.<br>- Normally when I think of getting food from a hookah place, I think of overpriced options of mediocre quality: that is so NOT the case here. I don't smoke but was intrigued by their online menu. <br>- Awesome locally-owned grocery store, with an excellent range of products. One of many, many local grocery places in this part of town, which has a massive and amazing array of ethnic restaurants. But this is one of the very best. The cashier was nice and helpful, and the products, while a little overpriced, are nowhere near as marked-up, out of date, and poor quality as a lot of the little convenience stores around here. You could actually shop at Fullworth instead of a brand name grocery store, and do fine. If I lived around here, I absolutely would.<br>- Prices were solid.  At about $10 per entree, it's not fast food prices, but not overpriced.  Good quality, good prices, I had no problem paying this bill.  There are definitely places in town that aren't worth that sort of price.<br>- First off. THE SHOES. Holy heavens...quality rich leathers in all sorts of beautiful colors and shapes and sizes. This is where you come to buy shoes that you'll WEAR. A lot. Shoes that go with everything. Boots that make people turn their heads. And unfortunately for me, price tags that made my mouth drop a bit. Not that I find them to be overpriced, just out of MY personal price range for the day. C'est la vie, I'd know where to find them when the money hit and I needed t foot fancy fast. <br>"},
    {"id": "overpriced", "group" :6,"content":"- This is the 2nd best sushi in Scottsdale, without being overpriced and over dramatized by $3 million decor, like most of the boring unauthentic restaurants in Snotsdale that snowboreds with money to burn go to get drunk. They have Japanese chefs, and they give you huge and fresh, oversized but correctly sliced fish on nicely groomed rice. You have to get here early, as it opens at 5:30 and fills up by 6. They have well prepared non-sushi dishes, too, and friendly service.<br>- note: if you find yourself parched and waiting for your honey to bring you some overpriced bottled water, there's a water fountain near the restroom!<br>- The food is good.  Staff is friendly.  Gas is overpriced ONLY when compared to my home area - not in comparison to the surrounding area and it's worth the few extra cents to get some yummy food!<br>- I enjoyed my lunch here although it's Vegas-overpriced. 3.5 stars.<br>- The bottom line for me is that I would stop by here again in the future.  While I believe that it is a bit overpriced to enjoy on a regular basis, the food is great and it could easily be a nice little treat every now and again.<br>- Drinks: overpriced BUT free champagne and vodka drinks for ladies on weeknights 11pm-midnight! <br>- The bottom line for me is that I would head back here again in the future.  While I found the beers themselves to be somewhat overpriced, the vibe of the place was pretty awesome and is what would get me to come back again.<br>"},
    {"id": "affordable", "group" :6,"content":"- Brand wise, you'll find upscale brands like Shoshanna, Amanda Uprichard, Alice & Trixie, Frock by Tracy Reese, James Jeans, Anlo and Citizens for Humanity. As mentioned, they have begun to add more affordable pieces from Greylin and LA Clothing. You'll also spy a handful of accessories and handbags scattered about in a range of prices. <br>- YES!!!!!  An affordable venue in Las Vegas.  You seriously can't go wrong with pinball games and they offer a wide variety of classic video games from the 80s.  This isn't your new era kind of killing games, which thank the lawd I can't stand those.  <br>- Mini Peanut Butter Cups with Vanilla Ice Cream that made with fresh milk and cream. And for $4.50 a tub or so.... So good and affordable!<br>- I never would have thought that it would be so affordable to stay in a super fancy hotel on the Las Vegas Strip.  If you look in the right places for discounts and deals, there are many offers to find.  While attending WWD Magic for work, for three nights I had the pleasure of calling the Venetian my home.  <br>- I have now been to all 3 chef Marc-Olivier Frappier's restaurants in Montreal. They are all consistent in service and food quality. The price point is quite affordable for what they offers. But Le Vin Papillon's offerings is just so unique and great for seafood lover like myself. Now I do have a second thought about Joe Beef being my favourite restaurant in Montreal!<br>- I found Lou's Diner by accident.  I was in their parking lot to answer an e-mail, starving, and noticed their sign.  I pulled up my Yelp app, read a few of my Yelp friend's reviews, and made up my mind that I'm having eggs for lunch.  I walked in and it wasn't busy at all.  I sat myself and was a little concerned that the service would take a while since no one noticed me walking in.  Within 10 minutes, one of the waitresses attended to me and gave me a menu.  Their menu is mainly a traditional American breakfast (i.e. omelets, sandwiches, burgers, soups, etc.).  I kept my meal simple and had their 3 egg cheese omelet, 4 slices of bacon, well done extra crispy hash browns, and some toast.  This breakfast combo was very affordable at only $8.  I also added a cup of their homemade chili, which ended up being the highlight of my entire meal.  The chili has a bit of a kick, hearty, and had enough meat to satisfy my protein needs.  A cup of their chili is good enough to make me a repeat customer. If I had one gripe, it's the cheese in their omelets.  I prefer shredded cheese in my omelets, not sliced cheese. Lou's Diner was able to add shredded cheese to my chili.  Why couldn't they do this for their omelets? In the future, I'll request it.  It never hurts to ask, right?<br>- Always a fan of In-N-Out. And being steps from my hotel (the LINQ) lobby, isn't such a bad place to be either. Like all locations, this place is cranking out the food! And being one of the more affordable options on the strip, it's definitely busy at all times of day. <br>- We finished of our night 3 out of our 4 nights in Montreal.  The dark forest green and warm wood colors created a warm atmosphere with a slightly more upscale crowd, and the best bartenders in Montreal.  Each night the same handsome bartender, whom shall remain unnamed, welcomed us with his lovely Quebecois accent and poured us some great cocktails and whiskeys.  On the first night, he gave us some free shots, and the following nights he gave us more freebies.   Despite us being obvious tourists, he genuinely seemed interested and socialized with us each night. He never tried to oversell us, and made some great recommendations on Canadian whiskeys that were delicious yet affordable(less than $10 serving).  The other good looking bartenders were friendly too. <br>"},
    {"id": "expensive", "group" :6,"content":"- We got our tickets at the half price place at the Coca cola bottle near the Coca cola store.  The tickets were $68 plus $7 fee per person for mid-range seats in the center.  There were cheaper and more expensive seats but the mid-range was perfect.  The performance was phenomenal.  The crowd is older so you don't see a lot of smartphones recording or taking photos, which was nice.  They even give you a fake lighter light to hold up and wave during ballads, which was a nice touch.  I'd recommend this for any 80s rock fans.  <br>- -Inexpensive...cash only!<br>- We got seated outside to views of the pool and garden, which was nice. I ordered a very expensive small glass of freshly squeezed orange juice and my husband had coffee to start. <br>- This location is pretty well-maintained and organized. They are also well-stocked for a browser like myself. The parking lot is usually pretty awful, so I tend to avoid this location for that reason alone, but otherwise it's a great store to peruse inexpensive items for sale.<br>- I Love Savory Spice!  We have one in Raleigh and still visit this one when in Charlotte!  If you think you have some Talent or want to acquire a Cooking skill, START Here!!!  Before you go to an expensive cooking school, that might, zap your creativity and ruin all your natural Talent, see what you can do with simple recipes, simple foods and GREAT Spices!<br>- Very good pizza by the slice and great service and people! Quick, inexpensive, and tasty meal.<br>- *Kobe Sliders: EXCELLENT. Yes, it's expensive ($24) for three white castle sized burgers with tempura battered onion rings, but well worth it. The kobe was tender and melted in your mouth. That in between the slightly sweet toasted bun and ponzu (?) mayo was an AMAZING combination. The onion rings were light and crispy, not too oily. <br>"},
    {"id": "mediocre", "group" :6,"content":"- Dessert was mixed.  They offer some pretty-looking bites, but fall short of the dessert offerings at The Wynn.  I tried a couple of chocolate raspberry items.  The square-shaped layered mousse cake bite was mediocre.  The one in the cone was better.  I also tried their apple pie which was okay too.  But no waffle or crepe station like The Wynn.  Most disappointing is the ice cream which comes out of a machine here.  So far, the gelato at Cravings (Mirage) is the best in this department.<br>- - The pork entree was pretty mediocre....pork should be extremely delicious, but this pork was just lacking flavor. The portion size was big, but that doesn't matter if it's not something you really would like to eat. <br>- The location is a little off the beaten path which is why, I think, people are lined up to get in the Breakfast Club a couple of blocks away for mediocre food, and here at Bacon- the food and service is better and there was no line on the Sunday I was there. <br>- Most importantly, there's a lounge bar where I hung out with my colleagues and tried to avoid saying anything embarrassing (photo: http://bit.ly/2aDTV9K). I ended up staying in a large-size guest room with two double beds for three nights, and it certainly met my minimum needs during the stay (photo: http://bit.ly/2amUFiw). It was the middle of the week, so the nightly rate was only $126. Since I didn't rent a car, the Westgate proved convenient for the obligatory group dinners even though the food quality was consistently mediocre. Regardless, the hotel itself was superior, and I'm sure I'll be back. Especially if my boss comes with me again.<br>- The brunch options here are great. I've been here a few times now and have never been disappointed. The breakfast poutine is a large portion and the hashbrowns are always nice and crispy. This is probably the best option for brunch in the shopping centre as there is no line so you're not waiting 20 minutes to sit down to eat a mediocre crepe at Cora's.<br>- If you're considering Taste or Carolina Beer Company, definitely head to Taste. It's lighter, feels less like a mediocre chain and has great beer on tap.<br>- Scottsdale prefers looks  over substance, so it likes nice decor in favor of good food, as exampled by the many large, formula restaurants with million dollar decors but mediocre food. And remember, PF Chang's, that popular faux Chinese chain, the epitome of Decor upstaging Taste, was started right here in the Valley  of the Sun. <br>- I was a little skeptical at first when I found out that this place had both Chinese and Vietnamese food because sometimes either one is better than the other or both would be equally mediocre.  We didn't have any issues with the parking here since it was shared in the whole plaza.  We came around 5:10pm on a Wednesday and it wasn't busy at first.  After a few minutes, this place had a lot of people.  I believe it was 5:45pm at that time. <br>- We dined in right after arriving in LAS and I was underwhelmed during my first visit. Burger was cheap & tasty, but not worth the raves IMO, and found the animal style fries mediocre. Very friendly service, though.<br>- Finally our table of hungry hippos decided it would be a good idea to order the sausage and peppers pizza.  The crust was a little charred, too much to a point where it was dry and mediocre.  I would give this another shot, especially since I've heard more former colleagues rave about this pizza than any other entree on their menu.<br>- The only standout dishes was the steamed tripe which was melt-in-your-mouth soft and the fried rice which was al-dente which bits of rich fatty pieces of pork (albeit a bit greasy).  The rest of the dishes were mediocre; they either lacked quality ingredients, were tiny (dumplings) compared to the norm and/or on the dry side. But when you're starving and there's a lack of good dim sum options, it sufficed just fine.<br>"},
    {"id": "concessions", "group" :6,"content":"- Phoenix is a very nice city to watch a baseball game.  This is particularly due to the air conditioned ballpark.  The ballpark also has good concessions and the fans are fun.<br>- I have to say their food court area is awesome! Just an amazing selection of foods to choose from, plus concessions stands everywhere. From buckets of wings, to fresh carving stations, to famous Primanti Brothers sandwiches, this is a football foodies heaven! Plus, a live band plays, and walking around the Steelers Hall Of Fame area is very cool.<br>- Then we went to find our seats, in section 225.  There's a huge long escalator to take you to the 200's.  What they don't say is there's not a lot of food upstairs, so stay downstairs to get your concessions and shopping done.  The team store is tiny, so take advantage of the kiosks located around the arena.  <br>- Upon walking in, I noticed right away that their food/concessions is different than most.  Food, snacks, and drinks are set up cafeteria style with most foods ready under heat lamps.  This eliminates the long lines, potentially slow popcorn/soda artist, and that linger movie goer (i.e. that person that can't make up their mind when they're in line).  I'm the one that's purchasing just a bottle of water behind someone ordering 4 popcorn's, 4 sodas, 4 Junior Mints, and a pretzel.  At this theater, I no longer have to wait behind these peeps and I could head straight to the register.  <br>- Headed here with a girlfriend to see Frozen, and we were easily able to grab a ticket at the window and head in.  There were plenty of staff members heading up the concessions, so we were both able to order at separate registers at the same time and head into our movie with snacks in hand in just a few minutes.  <br>- As Jimmy mentioned, concessions are surprisingly affordable with wine or beer at $4. Compare that to other theaters in Charlotte and this is pretty close to a steal. This is most definitely a gem in Charlotte and I plan to head over to Theatre Charlotte much more often to enjoy great productions put on and acted by volunteers in our fine city!<br>"},
    {"id": "homemade", "group" :2,"content":"- Lastly, try an entree or pasta or both... it's all good, I swear!  And if you have room, end with some of their homemade dessert!<br>- Located well outside the downtown area, a Detroit Avenue location putting the storefront near Gypsy Beans & Bakery in the slowly evolving Arts District, Sweet Moses Soda Fountain & Treat Shop has received regional acclaim by way of its oldschool approach to one of The Buckeye State's many obsessions - homemade Ice Cream along with several other styles of sweets and confections.<br>- I found Lou's Diner by accident.  I was in their parking lot to answer an e-mail, starving, and noticed their sign.  I pulled up my Yelp app, read a few of my Yelp friend's reviews, and made up my mind that I'm having eggs for lunch.  I walked in and it wasn't busy at all.  I sat myself and was a little concerned that the service would take a while since no one noticed me walking in.  Within 10 minutes, one of the waitresses attended to me and gave me a menu.  Their menu is mainly a traditional American breakfast (i.e. omelets, sandwiches, burgers, soups, etc.).  I kept my meal simple and had their 3 egg cheese omelet, 4 slices of bacon, well done extra crispy hash browns, and some toast.  This breakfast combo was very affordable at only $8.  I also added a cup of their homemade chili, which ended up being the highlight of my entire meal.  The chili has a bit of a kick, hearty, and had enough meat to satisfy my protein needs.  A cup of their chili is good enough to make me a repeat customer. If I had one gripe, it's the cheese in their omelets.  I prefer shredded cheese in my omelets, not sliced cheese. Lou's Diner was able to add shredded cheese to my chili.  Why couldn't they do this for their omelets? In the future, I'll request it.  It never hurts to ask, right?<br>- After all is said & done & the bill arrives, you're treated to a homemade Butterscotch Pudding that is absolutely 2-die-4.  Rich & creamy w/ tons of vanilla seeds all over the place!<br>"}







  ],
  "links":[
    {"source": "good", "target" :"decent","value":8},
    {"source": "good", "target" :"tasty","value":7},
    {"source": "good", "target" :"great","value":7},
    {"source": "good", "target" :"nice","value":6},
    {"source": "good", "target" :"solid","value":7},
    {"source": "solid", "target" :"cheap", "value":7},
    {"source": "solid", "target" :"fabulous","value":6},
    {"source": "solid", "target" :"reasonable","value":6},
    {"source": "service", "target" :"staff","value":8},
    {"source": "service", "target" :"atmosphere","value":6},
    {"source": "service", "target" :"efficient","value":6},
    {"source": "service", "target" :"ambiance", "value":6},
    {"source": "service", "target" :"attentive","value":6},
    {"source": "service", "target" :"friendly","value":6},
    {"source": "friendly", "target" :"helpful","value":9},
    {"source": "friendly", "target" :"polite", "value":8},
    {"source": "friendly", "target" :"knowledgeable","value":7},
    {"source": "friendly", "target" :"professional","value":7},
    {"source": "tasty", "target" :"delicious","value":9},
    {"source": "tasty", "target" :"yummy", "value":8},
    {"source": "tasty", "target" :"healthy","value":7},
    {"source": "tasty", "target" :"fresh","value":7},
    {"source": "ambiance", "target" :"deco", "value":9},
    {"source": "ambiance", "target" :"interior","value":8},
    {"source": "ambiance", "target" :"environment","value":7},
    {"source": "nice", "target" :"service", "value":2},
    {"source": "good", "target" :"service","value":1},
    {"source": "great", "target" :"service","value":1},
    {"source": "menu", "target" :"specials","value":6},
    {"source": "menu", "target" :"healthy","value":3},
    {"source": "menu", "target" :"items","value":5},
    {"source": "menu", "target" :"daily", "value":5},
    {"source": "menu", "target" :"selections","value":4},
    {"source": "menu", "target" :"pricing","value":5},
    {"source": "items", "target" :"dishes","value":8},
    {"source": "delicious", "target" :"dishes","value":4},
    {"source": "delicious", "target" :"fresh","value":7},
    {"source": "delicious", "target" :"good","value":3},
    {"source": "cheap", "target" :"pricing","value":4},
    {"source": "reasonable", "target" :"pricing","value":6},
    {"source": "dishes", "target" :"selections","value":7},
    {"source": "yummy", "target" :"fresh","value":7},
    {"source": "decent", "target" :"reasonable","value":8},
    {"source": "decent", "target" :"service","value":2},
    {"source": "decent", "target" :"great","value":7},
    {"source": "decent", "target" :"cheap","value":7},
    {"source": "decent", "target" :"nice","value":7},
    {"source": "pricing", "target" :"dishes","value":4},
    {"source": "staff", "target" :"friendly","value":7},
    {"source": "staff", "target" :"nice","value":2},
    {"source": "staff", "target" :"great","value":2},
    {"source": "staff", "target" :"professional","value":6},
    {"source": "service", "target" :"professional","value":4},
    {"source": "deco", "target" :"atmosphere","value":7},
    {"source": "service", "target" :"fabulous","value":0.7},
    {"source": "dishes", "target" :"healthy","value":2},
    {"source": "yummy", "target" :"homemade","value":8},
    {"source": "fresh", "target" :"healthy","value":5},
    {"source": "delicious", "target" :"healthy","value":6},
    {"source": "good", "target" :"ambiance","value":2},
    {"source": "yummy", "target" :"dishes","value":2},
    {"source": "pricing", "target" :"inflated","value":6},
    {"source": "pricing", "target" :"quality","value":6},
    {"source": "pricing", "target" :"overpriced","value":6},
    {"source": "pricing", "target" :"concessions","value":5},
    {"source": "overpriced", "target" :"affordable","value":7},
    {"source": "overpriced", "target" :"mediocre","value":5},
    {"source": "overpriced", "target" :"expensive","value":7},
    {"source": "overpriced", "target" :"inflated","value":6},
    {"source": "overpriced", "target" :"quality","value":3},
    {"source": "affordable", "target" :"pricing","value":5},
    {"source": "affordable", "target" :"concessions","value":2},
    {"source": "cheap", "target" :"reasonable","value":7},
    {"source": "affordable", "target" :"cheap","value":6},
    {"source": "cheap", "target" :"healthy","value":6},
    {"source": "dishes", "target" :"fresh","value":2},
    {"source": "dishes", "target" :"tasty","value":3},
    {"source": "dishes", "target" :"quality","value":2},
    {"source": "fresh", "target" :"homemade","value":7},
    {"source": "fresh", "target" :"sauces","value":6},
    {"source": "good", "target" :"sauces","value":1},
    {"source": "sauces", "target" :"delicious","value":4},
    {"source": "good", "target" :"quality","value":3},
    {"source": "homemade", "target" :"sauces","value":7},
    {"source": "service", "target" :"quality","value":3}







  ]
}
